STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/**
  * @brief Tamper and backup registers
  */
typedef struct
{
  __IO uint32_t CR1;           /*!< TAMP control register 1                           Address offset: 0x000 */
  __IO uint32_t CR2;           /*!< TAMP control register 2                           Address offset: 0x004 */
  __IO uint32_t CR3;           /*!< TAMP control register 3                           Address offset: 0x008 */
  __IO uint32_t FLTCR;         /*!< TAMP filter control register                      Address offset: 0x00C */
  __IO uint32_t ATCR1;         /*!< TAMP active tamper control register 1             Address offset: 0x010 */
  __IO uint32_t ATSEEDR;       /*!< TAMP active tamper seed register                  Address offset: 0x014 */
  __IO uint32_t ATOR;          /*!< TAMP active tamper output register                Address offset: 0x018 */
  __IO uint32_t ATCR2;         /*!< TAMP active tamper control register 2             Address offset: 0x01C */
  __IO uint32_t SECCFGR;       /*!< TAMP secure mode register                         Address offset: 0x020 */
  __IO uint32_t PRIVCR;        /*!< TAMP privilege mode control register              Address offset: 0x024 */
       uint32_t RESERVED0;     /*!< Reserved                                          Address offset: 0x028 */
  __IO uint32_t IER;           /*!< TAMP interrupt enable register                    Address offset: 0x02C */
  __IO uint32_t SR;            /*!< TAMP status register                              Address offset: 0x030 */
  __IO uint32_t MISR;          /*!< TAMP non-secure masked interrupt status register  Address offset: 0x034 */
  __IO uint32_t SMISR;         /*!< TAMP secure masked interrupt status register      Address offset: 0x038 */
  __IO uint32_t SCR;           /*!< TAMP status clear register                        Address offset: 0x03C */
  __IO uint32_t COUNT1R;       /*!< TAMP monotonic counter 1 register                 Address offset: 0x040 */
  __IO uint32_t COUNT2R;       /*!< TAMP monotonic counter 2 register                 Address offset: 0x044 */
       uint32_t RESERVED1[2];  /*!< Reserved                                          Address offset: 0x048-0x04C */
  __IO uint32_t OR;            /*!< TAMP option register                              Address offset: 0x050 */
  __IO uint32_t ERCFGR;        /*!< TAMP erase configuration register                 Address offset: 0x054 */
       uint32_t RESERVED2[6];  /*!< Reserved                                          Address offset: 0x058-0x06C */
  __IO uint32_t BKPRIFR1;      /*!< TAMP Backup registers RIF register 1              Address offset: 0x070 */
  __IO uint32_t BKPRIFR2;      /*!< TAMP Backup registers RIF register 2              Address offset: 0x074 */
  __IO uint32_t BKPRIFR3;      /*!< TAMP Backup registers RIF register 3              Address offset: 0x078 */
       uint32_t RESERVED3;     /*!< Reserved                                          Address offset: 0x07C */
  __IO uint32_t RCIDCFGR[3];   /*!< TAMP Resource CID configuration register          Address offset: 0x080-0x088 */
       uint32_t RESERVED4[29]; /*!< Reserved                                          Address offset: 0x08C-0x0FC */
  __IO uint32_t BKP0R;         /*!< TAMP backup register 0                            Address offset: 0x100 */
  __IO uint32_t BKP1R;         /*!< TAMP backup register 1                            Address offset: 0x104 */
  __IO uint32_t BKP2R;         /*!< TAMP backup register 2                            Address offset: 0x108 */
  __IO uint32_t BKP3R;         /*!< TAMP backup register 3                            Address offset: 0x10C */
  __IO uint32_t BKP4R;         /*!< TAMP backup register 4                            Address offset: 0x110 */
  __IO uint32_t BKP5R;         /*!< TAMP backup register 5                            Address offset: 0x114 */
  __IO uint32_t BKP6R;         /*!< TAMP backup register 6                            Address offset: 0x118 */
  __IO uint32_t BKP7R;         /*!< TAMP backup register 7                            Address offset: 0x11C */
  __IO uint32_t BKP8R;         /*!< TAMP backup register 8                            Address offset: 0x120 */
  __IO uint32_t BKP9R;         /*!< TAMP backup register 9                            Address offset: 0x124 */
  __IO uint32_t BKP10R;        /*!< TAMP backup register 10                           Address offset: 0x128 */
  __IO uint32_t BKP11R;        /*!< TAMP backup register 11                           Address offset: 0x12C */
  __IO uint32_t BKP12R;        /*!< TAMP backup register 12                           Address offset: 0x130 */
  __IO uint32_t BKP13R;        /*!< TAMP backup register 13                           Address offset: 0x134 */
  __IO uint32_t BKP14R;        /*!< TAMP backup register 14                           Address offset: 0x138 */
  __IO uint32_t BKP15R;        /*!< TAMP backup register 15                           Address offset: 0x13C */
  __IO uint32_t BKP16R;        /*!< TAMP backup register 16                           Address offset: 0x140 */
  __IO uint32_t BKP17R;        /*!< TAMP backup register 17                           Address offset: 0x144 */
  __IO uint32_t BKP18R;        /*!< TAMP backup register 18                           Address offset: 0x148 */
  __IO uint32_t BKP19R;        /*!< TAMP backup register 19                           Address offset: 0x14C */
  __IO uint32_t BKP20R;        /*!< TAMP backup register 20                           Address offset: 0x150 */
  __IO uint32_t BKP21R;        /*!< TAMP backup register 21                           Address offset: 0x154 */
  __IO uint32_t BKP22R;        /*!< TAMP backup register 22                           Address offset: 0x158 */
  __IO uint32_t BKP23R;        /*!< TAMP backup register 23                           Address offset: 0x15C */
  __IO uint32_t BKP24R;        /*!< TAMP backup register 24                           Address offset: 0x160 */
  __IO uint32_t BKP25R;        /*!< TAMP backup register 25                           Address offset: 0x164 */
  __IO uint32_t BKP26R;        /*!< TAMP backup register 26                           Address offset: 0x168 */
  __IO uint32_t BKP27R;        /*!< TAMP backup register 27                           Address offset: 0x16C */
  __IO uint32_t BKP28R;        /*!< TAMP backup register 28                           Address offset: 0x170 */
  __IO uint32_t BKP29R;        /*!< TAMP backup register 29                           Address offset: 0x174 */
  __IO uint32_t BKP30R;        /*!< TAMP backup register 30                           Address offset: 0x178 */
  __IO uint32_t BKP31R;        /*!< TAMP backup register 31                           Address offset: 0x17C */
  __IO uint32_t BKP32R;        /*!< TAMP backup register 32                           Address offset: 0x180 */
  __IO uint32_t BKP33R;        /*!< TAMP backup register 33                           Address offset: 0x184 */
  __IO uint32_t BKP34R;        /*!< TAMP backup register 34                           Address offset: 0x188 */
  __IO uint32_t BKP35R;        /*!< TAMP backup register 35                           Address offset: 0x18C */
  __IO uint32_t BKP36R;        /*!< TAMP backup register 36                           Address offset: 0x190 */
  __IO uint32_t BKP37R;        /*!< TAMP backup register 37                           Address offset: 0x194 */
  __IO uint32_t BKP38R;        /*!< TAMP backup register 38                           Address offset: 0x198 */
  __IO uint32_t BKP39R;        /*!< TAMP backup register 39                           Address offset: 0x19C */
  __IO uint32_t BKP40R;        /*!< TAMP backup register 40                           Address offset: 0x1A0 */
  __IO uint32_t BKP41R;        /*!< TAMP backup register 41                           Address offset: 0x1A4 */
  __IO uint32_t BKP42R;        /*!< TAMP backup register 42                           Address offset: 0x1A8 */
  __IO uint32_t BKP43R;        /*!< TAMP backup register 43                           Address offset: 0x1AC */
  __IO uint32_t BKP44R;        /*!< TAMP backup register 44                           Address offset: 0x1B0 */
  __IO uint32_t BKP45R;        /*!< TAMP backup register 45                           Address offset: 0x1B4 */
  __IO uint32_t BKP46R;        /*!< TAMP backup register 46                           Address offset: 0x1B8 */
  __IO uint32_t BKP47R;        /*!< TAMP backup register 47                           Address offset: 0x1BC */
  __IO uint32_t BKP48R;        /*!< TAMP backup register 48                           Address offset: 0x1C0 */
  __IO uint32_t BKP49R;        /*!< TAMP backup register 49                           Address offset: 0x1C4 */
  __IO uint32_t BKP50R;        /*!< TAMP backup register 50                           Address offset: 0x1C8 */
  __IO uint32_t BKP51R;        /*!< TAMP backup register 51                           Address offset: 0x1CC */
  __IO uint32_t BKP52R;        /*!< TAMP backup register 52                           Address offset: 0x1D0 */
  __IO uint32_t BKP53R;        /*!< TAMP backup register 53                           Address offset: 0x1D4 */
  __IO uint32_t BKP54R;        /*!< TAMP backup register 54                           Address offset: 0x1D8 */
  __IO uint32_t BKP55R;        /*!< TAMP backup register 55                           Address offset: 0x1DC */
  __IO uint32_t BKP56R;        /*!< TAMP backup register 56                           Address offset: 0x1E0 */
  __IO uint32_t BKP57R;        /*!< TAMP backup register 57                           Address offset: 0x1E4 */
  __IO uint32_t BKP58R;        /*!< TAMP backup register 58                           Address offset: 0x1E8 */
  __IO uint32_t BKP59R;        /*!< TAMP backup register 59                           Address offset: 0x1EC */
  __IO uint32_t BKP60R;        /*!< TAMP backup register 60                           Address offset: 0x1F0 */
  __IO uint32_t BKP61R;        /*!< TAMP backup register 61                           Address offset: 0x1F4 */
  __IO uint32_t BKP62R;        /*!< TAMP backup register 62                           Address offset: 0x1F8 */
  __IO uint32_t BKP63R;        /*!< TAMP backup register 63                           Address offset: 0x1FC */
  __IO uint32_t BKP64R;        /*!< TAMP backup register 64                           Address offset: 0x200 */
  __IO uint32_t BKP65R;        /*!< TAMP backup register 65                           Address offset: 0x204 */
  __IO uint32_t BKP66R;        /*!< TAMP backup register 66                           Address offset: 0x208 */
  __IO uint32_t BKP67R;        /*!< TAMP backup register 67                           Address offset: 0x20C */
  __IO uint32_t BKP68R;        /*!< TAMP backup register 68                           Address offset: 0x210 */
  __IO uint32_t BKP69R;        /*!< TAMP backup register 69                           Address offset: 0x214 */
  __IO uint32_t BKP70R;        /*!< TAMP backup register 70                           Address offset: 0x218 */
  __IO uint32_t BKP71R;        /*!< TAMP backup register 71                           Address offset: 0x21C */
  __IO uint32_t BKP72R;        /*!< TAMP backup register 72                           Address offset: 0x220 */
  __IO uint32_t BKP73R;        /*!< TAMP backup register 73                           Address offset: 0x224 */
  __IO uint32_t BKP74R;        /*!< TAMP backup register 74                           Address offset: 0x228 */
  __IO uint32_t BKP75R;        /*!< TAMP backup register 75                           Address offset: 0x22C */
  __IO uint32_t BKP76R;        /*!< TAMP backup register 76                           Address offset: 0x230 */
  __IO uint32_t BKP77R;        /*!< TAMP backup register 77                           Address offset: 0x234 */
  __IO uint32_t BKP78R;        /*!< TAMP backup register 78                           Address offset: 0x238 */
  __IO uint32_t BKP79R;        /*!< TAMP backup register 79                           Address offset: 0x23C */
  __IO uint32_t BKP80R;        /*!< TAMP backup register 80                           Address offset: 0x240 */
  __IO uint32_t BKP81R;        /*!< TAMP backup register 81                           Address offset: 0x244 */
  __IO uint32_t BKP82R;        /*!< TAMP backup register 82                           Address offset: 0x248 */
  __IO uint32_t BKP83R;        /*!< TAMP backup register 83                           Address offset: 0x24C */
  __IO uint32_t BKP84R;        /*!< TAMP backup register 84                           Address offset: 0x250 */
  __IO uint32_t BKP85R;        /*!< TAMP backup register 85                           Address offset: 0x254 */
  __IO uint32_t BKP86R;        /*!< TAMP backup register 86                           Address offset: 0x258 */
  __IO uint32_t BKP87R;        /*!< TAMP backup register 87                           Address offset: 0x25C */
  __IO uint32_t BKP88R;        /*!< TAMP backup register 88                           Address offset: 0x260 */
  __IO uint32_t BKP89R;        /*!< TAMP backup register 89                           Address offset: 0x264 */
  __IO uint32_t BKP90R;        /*!< TAMP backup register 90                           Address offset: 0x268 */
  __IO uint32_t BKP91R;        /*!< TAMP backup register 91                           Address offset: 0x26C */
  __IO uint32_t BKP92R;        /*!< TAMP backup register 92                           Address offset: 0x270 */
  __IO uint32_t BKP93R;        /*!< TAMP backup register 93                           Address offset: 0x274 */
  __IO uint32_t BKP94R;        /*!< TAMP backup register 94                           Address offset: 0x278 */
  __IO uint32_t BKP95R;        /*!< TAMP backup register 95                           Address offset: 0x27C */
  __IO uint32_t BKP96R;        /*!< TAMP backup register 96                           Address offset: 0x280 */
  __IO uint32_t BKP97R;        /*!< TAMP backup register 97                           Address offset: 0x284 */
  __IO uint32_t BKP98R;        /*!< TAMP backup register 98                           Address offset: 0x288 */
  __IO uint32_t BKP99R;        /*!< TAMP backup register 99                           Address offset: 0x28C */
  __IO uint32_t BKP100R;       /*!< TAMP backup register 100                          Address offset: 0x290 */
  __IO uint32_t BKP101R;       /*!< TAMP backup register 101                          Address offset: 0x294 */
  __IO uint32_t BKP102R;       /*!< TAMP backup register 102                          Address offset: 0x298 */
  __IO uint32_t BKP103R;       /*!< TAMP backup register 103                          Address offset: 0x29C */
  __IO uint32_t BKP104R;       /*!< TAMP backup register 104                          Address offset: 0x2A0 */
  __IO uint32_t BKP105R;       /*!< TAMP backup register 105                          Address offset: 0x2A4 */
  __IO uint32_t BKP106R;       /*!< TAMP backup register 106                          Address offset: 0x2A8 */
  __IO uint32_t BKP107R;       /*!< TAMP backup register 107                          Address offset: 0x2AC */
  __IO uint32_t BKP108R;       /*!< TAMP backup register 108                          Address offset: 0x2B0 */
  __IO uint32_t BKP109R;       /*!< TAMP backup register 109                          Address offset: 0x2B4 */
  __IO uint32_t BKP110R;       /*!< TAMP backup register 110                          Address offset: 0x2B8 */
  __IO uint32_t BKP111R;       /*!< TAMP backup register 111                          Address offset: 0x2BC */
  __IO uint32_t BKP112R;       /*!< TAMP backup register 112                          Address offset: 0x2C0 */
  __IO uint32_t BKP113R;       /*!< TAMP backup register 113                          Address offset: 0x2C4 */
  __IO uint32_t BKP114R;       /*!< TAMP backup register 114                          Address offset: 0x2C8 */
  __IO uint32_t BKP115R;       /*!< TAMP backup register 115                          Address offset: 0x2CC */
  __IO uint32_t BKP116R;       /*!< TAMP backup register 116                          Address offset: 0x2D0 */
  __IO uint32_t BKP117R;       /*!< TAMP backup register 117                          Address offset: 0x2D4 */
  __IO uint32_t BKP118R;       /*!< TAMP backup register 118                          Address offset: 0x2D8 */
  __IO uint32_t BKP119R;       /*!< TAMP backup register 119                          Address offset: 0x2DC */
  __IO uint32_t BKP120R;       /*!< TAMP backup register 120                          Address offset: 0x2E0 */
  __IO uint32_t BKP121R;       /*!< TAMP backup register 121                          Address offset: 0x2E4 */
  __IO uint32_t BKP122R;       /*!< TAMP backup register 122                          Address offset: 0x2E8 */
  __IO uint32_t BKP123R;       /*!< TAMP backup register 123                          Address offset: 0x2EC */
  __IO uint32_t BKP124R;       /*!< TAMP backup register 124                          Address offset: 0x2F0 */
  __IO uint32_t BKP125R;       /*!< TAMP backup register 125                          Address offset: 0x2F4 */
  __IO uint32_t BKP126R;       /*!< TAMP backup register 126                          Address offset: 0x2F8 */
  __IO uint32_t BKP127R;       /*!< TAMP backup register 127                          Address offset: 0x2FC */
       uint32_t RESERVED5[59]; /*!< Reserved                                          Address offset: 0x300-0x3E8 */
  __IO uint32_t HWCFGR2;       /*!< TAMP hardware configuration register 2            Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;       /*!< TAMP hardware configuration register 1            Address offset: 0x3F0 */
  __IO uint32_t VERR;          /*!< TAMP version register                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;         /*!< TAMP identification register                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;          /*!< TAMP size identification register                 Address offset: 0x3FC */
} TAMP_TypeDef;

/**
  * @brief TIM
  */
typedef struct
{
  __IO uint32_t CR1;             /*!< TIM control register 1                    Address offset: 0x000 */
  __IO uint32_t CR2;             /*!< TIM control register 2                    Address offset: 0x004 */
  __IO uint32_t SMCR;            /*!< TIM slave mode control register           Address offset: 0x008 */
  __IO uint32_t DIER;            /*!< TIM DMA/interrupt enable register         Address offset: 0x00C */
  __IO uint32_t SR;              /*!< TIM status register                       Address offset: 0x010 */
  __IO uint32_t EGR;             /*!< TIM event generation register             Address offset: 0x014 */
  __IO uint32_t CCMR1;           /*!< TIM capture/compare mode register 1       Address offset: 0x018 */
  __IO uint32_t CCMR2;           /*!< TIM capture/compare mode register 2       Address offset: 0x01C */
  __IO uint32_t CCER;            /*!< TIM capture/compare enable register       Address offset: 0x020 */
  __IO uint32_t CNT;             /*!< TIM counter register                      Address offset: 0x024 */
  __IO uint32_t PSC;             /*!< TIM prescaler                             Address offset: 0x028 */
  __IO uint32_t ARR;             /*!< TIM auto-reload register                  Address offset: 0x02C */
  __IO uint32_t RCR;             /*!< TIM repetition counter register           Address offset: 0x030 */
  __IO uint32_t CCR1;            /*!< TIM capture/compare register 1            Address offset: 0x034 */
  __IO uint32_t CCR2;            /*!< TIM capture/compare register 2            Address offset: 0x038 */
  __IO uint32_t CCR3;            /*!< TIM capture/compare register 3            Address offset: 0x03C */
  __IO uint32_t CCR4;            /*!< TIM capture/compare register 4            Address offset: 0x040 */
  __IO uint32_t BDTR;            /*!< TIM break and dead-time register          Address offset: 0x044 */
  __IO uint32_t CCR5;            /*!< TIM capture/compare register 5            Address offset: 0x048 */
  __IO uint32_t CCR6;            /*!< TIM capture/compare register 6            Address offset: 0x04C */
  __IO uint32_t CCMR3;           /*!< TIM capture/compare mode register 3       Address offset: 0x050 */
  __IO uint32_t DTR2;            /*!< TIM timer deadtime register 2             Address offset: 0x054 */
  __IO uint32_t ECR;             /*!< TIM timer encoder control register        Address offset: 0x058 */
  __IO uint32_t TISEL;           /*!< TIM timer Input Selection register        Address offset: 0x05C */
  __IO uint32_t AF1;             /*!< TIM alternate function option register 1  Address offset: 0x060 */
  __IO uint32_t AF2;             /*!< TIM alternate function option register 2  Address offset: 0x064 */
       uint32_t RESERVED0[221];  /*!< Reserved                                  Address offset: 0x068-0x3D8 */
  __IO uint32_t DCR;             /*!< TIM DMA control register                  Address offset: 0x3DC */
  __IO uint32_t DMAR;            /*!< TIM DMA address for full transfer         Address offset: 0x3E0 */
       uint32_t RESERVED1[2];    /*!< Reserved                                  Address offset: 0x3E4-0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< TIM hardware configuration 2 register     Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< TIM hardware configuration 1 register     Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< TIM version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< TIM IP identification register            Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< TIM size ID register                      Address offset: 0x3FC */
} TIM_TypeDef;

/**
  * @brief UCPD
  */
typedef struct
{
  __IO uint32_t CFG1;            /*!< UCPD configuration register 1,             Address offset: 0x00 */
  __IO uint32_t CFG2;            /*!< UCPD configuration register 2,             Address offset: 0x04 */
  __IO uint32_t CFG3;            /*!< UCPD configuration register 3,             Address offset: 0x08 */
  __IO uint32_t CR;              /*!< UCPD control register,                     Address offset: 0x0C */
  __IO uint32_t IMR;             /*!< UCPD interrupt mask register,              Address offset: 0x10 */
  __IO uint32_t SR;              /*!< UCPD status register,                      Address offset: 0x14 */
  __IO uint32_t ICR;             /*!< UCPD interrupt flag clear register         Address offset: 0x18 */
  __IO uint32_t TX_ORDSET;       /*!< UCPD Tx ordered set type register,         Address offset: 0x1C */
  __IO uint32_t TX_PAYSZ;        /*!< UCPD Tx payload size register,             Address offset: 0x20 */
  __IO uint32_t TXDR;            /*!< UCPD Tx data register,                     Address offset: 0x24 */
  __IO uint32_t RX_ORDSET;       /*!< UCPD Rx ordered set type register,         Address offset: 0x28 */
  __IO uint32_t RX_PAYSZ;        /*!< UCPD Rx payload size register,             Address offset: 0x2C */
  __IO uint32_t RXDR;            /*!< UCPD Rx data register,                     Address offset: 0x30 */
  __IO uint32_t RX_ORDEXT1;      /*!< UCPD Rx ordered set extension 1 register,  Address offset: 0x34 */
  __IO uint32_t RX_ORDEXT2;      /*!< UCPD Rx ordered set extension 2 register,  Address offset: 0x38 */
       uint32_t RESERVED0[238];  /*!< Reserved                                 Address offset: 0x03C-0x3F0 */
  __IO uint32_t VERR;            /*!< UCPD version register                    Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< UCPD identification register             Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< UCPD size identification register        Address offset: 0x3FC */
} UCPD_TypeDef;

