STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/***************  Bit definition for LVDS_PMPLLTWGCR1 register  ***************/
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos                  (0U)
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Msk                  (0xFFFFFUL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)              /*!< 0x000FFFFF */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP                      LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Msk                            /*!< MDIV divdier used in integer N and Fractional N PLL modes */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_0                    (0x1UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                  /*!< 0x00000001 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_1                    (0x2UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                  /*!< 0x00000002 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_2                    (0x4UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                  /*!< 0x00000004 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_3                    (0x8UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                  /*!< 0x00000008 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_4                    (0x10UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                 /*!< 0x00000010 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_5                    (0x20UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                 /*!< 0x00000020 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_6                    (0x40UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                 /*!< 0x00000040 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_7                    (0x80UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                 /*!< 0x00000080 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_8                    (0x100UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                /*!< 0x00000100 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_9                    (0x200UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                /*!< 0x00000200 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_10                   (0x400UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                /*!< 0x00000400 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_11                   (0x800UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)                /*!< 0x00000800 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_12                   (0x1000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)               /*!< 0x00001000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_13                   (0x2000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)               /*!< 0x00002000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_14                   (0x4000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)               /*!< 0x00004000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_15                   (0x8000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)               /*!< 0x00008000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_16                   (0x10000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)              /*!< 0x00010000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_17                   (0x20000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)              /*!< 0x00020000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_18                   (0x40000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)              /*!< 0x00040000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_19                   (0x80000UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_STEP_Pos)              /*!< 0x00080000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_DOWN_SPREAD_Pos           (20U)
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_DOWN_SPREAD_Msk           (0x1UL << LVDS_PMPLLTWGCR1_MST_PLL_TWG_DOWN_SPREAD_Pos)           /*!< 0x00100000 */
#define LVDS_PMPLLTWGCR1_MST_PLL_TWG_DOWN_SPREAD               LVDS_PMPLLTWGCR1_MST_PLL_TWG_DOWN_SPREAD_Msk                     /*!< TWG pattern spreading */

/***************  Bit definition for LVDS_PMPLLTWGCR2 register  ***************/
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos             (0U)
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Msk             (0x7FFFFFUL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)        /*!< 0x007FFFFF */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD                 LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Msk                       /*!< TWG_THRESHOLD setting */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_0               (0x1UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000001 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_1               (0x2UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000002 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_2               (0x4UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000004 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_3               (0x8UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)             /*!< 0x00000008 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_4               (0x10UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000010 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_5               (0x20UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000020 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_6               (0x40UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000040 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_7               (0x80UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)            /*!< 0x00000080 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_8               (0x100UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000100 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_9               (0x200UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000200 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_10              (0x400UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000400 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_11              (0x800UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)           /*!< 0x00000800 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_12              (0x1000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00001000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_13              (0x2000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00002000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_14              (0x4000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00004000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_15              (0x8000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)          /*!< 0x00008000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_16              (0x10000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00010000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_17              (0x20000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00020000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_18              (0x40000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00040000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_19              (0x80000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)         /*!< 0x00080000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_20              (0x100000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)        /*!< 0x00100000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_21              (0x200000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)        /*!< 0x00200000 */
#define LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_22              (0x400000UL << LVDS_PMPLLTWGCR2_MST_PLL_TWG_THRESHOLD_Pos)        /*!< 0x00400000 */

/***************  Bit definition for LVDS_PMPLLLDOCR register  ****************/
#define LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Pos             (0U)
#define LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Msk             (0x7UL << LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000007 */
#define LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM                 LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Msk                       /*!< PLL LDO output voltage fine tuning: */
#define LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_0               (0x1UL << LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000001 */
#define LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_1               (0x2UL << LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000002 */
#define LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_2               (0x4UL << LVDS_PMPLLLDOCR_MST_PLL_LDO_FRREGVTRIM_Pos)             /*!< 0x00000004 */

/****************  Bit definition for LVDS_PMPLLCPCR register  ****************/
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Pos                      (0U)
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Msk                      (0xFUL << LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Pos)                      /*!< 0x0000000F */
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL                          LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Msk                                /*!< PLL charge pump control, default=1. */
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL_0                        (0x1UL << LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Pos)                      /*!< 0x00000001 */
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL_1                        (0x2UL << LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Pos)                      /*!< 0x00000002 */
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL_2                        (0x4UL << LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Pos)                      /*!< 0x00000004 */
#define LVDS_PMPLLCPCR_MST_PLL_CPCTRL_3                        (0x8UL << LVDS_PMPLLCPCR_MST_PLL_CPCTRL_Pos)                      /*!< 0x00000008 */

/***************  Bit definition for LVDS_PMPLLCFGCR register  ****************/
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos                        (0U)
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_Msk                        (0xFFUL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                       /*!< 0x000000FF */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG                            LVDS_PMPLLCFGCR_MST_PLL_CFG_Msk                                  /*!< PLL configuration */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_0                          (0x1UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                        /*!< 0x00000001 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_1                          (0x2UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                        /*!< 0x00000002 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_2                          (0x4UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                        /*!< 0x00000004 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_3                          (0x8UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                        /*!< 0x00000008 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_4                          (0x10UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                       /*!< 0x00000010 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_5                          (0x20UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                       /*!< 0x00000020 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_6                          (0x40UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                       /*!< 0x00000040 */
#define LVDS_PMPLLCFGCR_MST_PLL_CFG_7                          (0x80UL << LVDS_PMPLLCFGCR_MST_PLL_CFG_Pos)                       /*!< 0x00000080 */

