STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/****************  Bit definition for LVDS_PSMPLOVSR register  ****************/
#define LVDS_PSMPLOVSR_SLV_MON_LDO_OK_PERMANENT_FAULT_Pos      (0U)
#define LVDS_PSMPLOVSR_SLV_MON_LDO_OK_PERMANENT_FAULT_Msk      (0x1UL << LVDS_PSMPLOVSR_SLV_MON_LDO_OK_PERMANENT_FAULT_Pos)      /*!< 0x00000001 */
#define LVDS_PSMPLOVSR_SLV_MON_LDO_OK_PERMANENT_FAULT          LVDS_PSMPLOVSR_SLV_MON_LDO_OK_PERMANENT_FAULT_Msk                /*!< PLL LDO Output Voltage monitor permanent fault */
#define LVDS_PSMPLOVSR_SLV_MON_LDO_OK_FAULT_Pos                (4U)
#define LVDS_PSMPLOVSR_SLV_MON_LDO_OK_FAULT_Msk                (0x1UL << LVDS_PSMPLOVSR_SLV_MON_LDO_OK_FAULT_Pos)                /*!< 0x00000010 */
#define LVDS_PSMPLOVSR_SLV_MON_LDO_OK_FAULT                    LVDS_PSMPLOVSR_SLV_MON_LDO_OK_FAULT_Msk                          /*!< PLL LDO output voltage monitor fault */

/*****************  Bit definition for LVDS_PSMPLCR register  *****************/
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_FORCE_FAULT_Pos          (0U)
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_FORCE_FAULT_Msk          (0x1UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_FORCE_FAULT_Pos)          /*!< 0x00000001 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_FORCE_FAULT              LVDS_PSMPLCR_SLV_MON_PLL_LOCK_FORCE_FAULT_Msk                    /*!< PLL Lock monitor force fault */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_CLEAR_FAULT_Pos          (4U)
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_CLEAR_FAULT_Msk          (0x1UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_CLEAR_FAULT_Pos)          /*!< 0x00000010 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_CLEAR_FAULT              LVDS_PSMPLCR_SLV_MON_PLL_LOCK_CLEAR_FAULT_Msk                    /*!< PLL Lock monitor clear fault */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos          (16U)
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Msk          (0x1FFUL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)        /*!< 0x01FF0000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE              LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Msk                    /*!< PLL Lock timing control for the monitor unmask after startup */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_0            (0x1UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00010000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_1            (0x2UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00020000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_2            (0x4UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00040000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_3            (0x8UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)      /*!< 0x00080000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_4            (0x10UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00100000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_5            (0x20UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00200000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_6            (0x40UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00400000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_7            (0x80UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)     /*!< 0x00800000 */
#define LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_8            (0x100UL << LVDS_PSMPLCR_SLV_MON_PLL_LOCK_UNMASK_TUNE_Pos)    /*!< 0x01000000 */

/*****************  Bit definition for LVDS_PSMPLSR register  *****************/
#define LVDS_PSMPLSR_SLV_MON_PLL_LOCK_PERMANENT_FAULT_Pos      (0U)
#define LVDS_PSMPLSR_SLV_MON_PLL_LOCK_PERMANENT_FAULT_Msk      (0x1UL << LVDS_PSMPLSR_SLV_MON_PLL_LOCK_PERMANENT_FAULT_Pos)      /*!< 0x00000001 */
#define LVDS_PSMPLSR_SLV_MON_PLL_LOCK_PERMANENT_FAULT          LVDS_PSMPLSR_SLV_MON_PLL_LOCK_PERMANENT_FAULT_Msk                /*!< PLL Lock monitor permanent fault */
#define LVDS_PSMPLSR_SLV_MON_PLL_LOCK_FAULT_Pos                (4U)
#define LVDS_PSMPLSR_SLV_MON_PLL_LOCK_FAULT_Msk                (0x1UL << LVDS_PSMPLSR_SLV_MON_PLL_LOCK_FAULT_Pos)                /*!< 0x00000010 */
#define LVDS_PSMPLSR_SLV_MON_PLL_LOCK_FAULT                    LVDS_PSMPLSR_SLV_MON_PLL_LOCK_FAULT_Msk                          /*!< PLL Lock monitor fault */

/****************  Bit definition for LVDS_PSMPROCR register  *****************/
#define LVDS_PSMPROCR_SLV_MON_REF_OK_FORCE_FAULT_Pos           (0U)
#define LVDS_PSMPROCR_SLV_MON_REF_OK_FORCE_FAULT_Msk           (0x1UL << LVDS_PSMPROCR_SLV_MON_REF_OK_FORCE_FAULT_Pos)           /*!< 0x00000001 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_FORCE_FAULT               LVDS_PSMPROCR_SLV_MON_REF_OK_FORCE_FAULT_Msk                     /*!< PLL Reference monitor force fault */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_CLEAR_FAULT_Pos           (4U)
#define LVDS_PSMPROCR_SLV_MON_REF_OK_CLEAR_FAULT_Msk           (0x1UL << LVDS_PSMPROCR_SLV_MON_REF_OK_CLEAR_FAULT_Pos)           /*!< 0x00000010 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_CLEAR_FAULT               LVDS_PSMPROCR_SLV_MON_REF_OK_CLEAR_FAULT_Msk                     /*!< PLL Reference monitor clear fault */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos           (16U)
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Msk           (0x1FFUL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)         /*!< 0x01FF0000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE               LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Msk                     /*!< PLL Reference timing control for the monitor unmask after startup */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_0             (0x1UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00010000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_1             (0x2UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00020000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_2             (0x4UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00040000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_3             (0x8UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)       /*!< 0x00080000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_4             (0x10UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00100000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_5             (0x20UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00200000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_6             (0x40UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00400000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_7             (0x80UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)      /*!< 0x00800000 */
#define LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_8             (0x100UL << LVDS_PSMPROCR_SLV_MON_REF_OK_UNMASK_TUNE_Pos)     /*!< 0x01000000 */

/****************  Bit definition for LVDS_PSMPROSR register  *****************/
#define LVDS_PSMPROSR_SLV_MON_REF_OK_PERMANENT_FAULT_Pos       (0U)
#define LVDS_PSMPROSR_SLV_MON_REF_OK_PERMANENT_FAULT_Msk       (0x1UL << LVDS_PSMPROSR_SLV_MON_REF_OK_PERMANENT_FAULT_Pos)       /*!< 0x00000001 */
#define LVDS_PSMPROSR_SLV_MON_REF_OK_PERMANENT_FAULT           LVDS_PSMPROSR_SLV_MON_REF_OK_PERMANENT_FAULT_Msk                 /*!< PLL Reference OK monitor permanent fault */
#define LVDS_PSMPROSR_SLV_MON_REF_OK_FAULT_Pos                 (4U)
#define LVDS_PSMPROSR_SLV_MON_REF_OK_FAULT_Msk                 (0x1UL << LVDS_PSMPROSR_SLV_MON_REF_OK_FAULT_Pos)                 /*!< 0x00000010 */
#define LVDS_PSMPROSR_SLV_MON_REF_OK_FAULT                     LVDS_PSMPROSR_SLV_MON_REF_OK_FAULT_Msk                           /*!< PLL Reference OK monitor fault */

/*****************  Bit definition for LVDS_PSMSCCR register  *****************/
#define LVDS_PSMSCCR_SLV_SER_CLK_ERROR_INJ_Pos                 (0U)
#define LVDS_PSMSCCR_SLV_SER_CLK_ERROR_INJ_Msk                 (0x1UL << LVDS_PSMSCCR_SLV_SER_CLK_ERROR_INJ_Pos)                 /*!< 0x00000001 */
#define LVDS_PSMSCCR_SLV_SER_CLK_ERROR_INJ                     LVDS_PSMSCCR_SLV_SER_CLK_ERROR_INJ_Msk                           /*!< Serializer clock checking error injection */
#define LVDS_PSMSCCR_SLV_SER_CLK_CLEAR_FAULT_Pos               (4U)
#define LVDS_PSMSCCR_SLV_SER_CLK_CLEAR_FAULT_Msk               (0x1UL << LVDS_PSMSCCR_SLV_SER_CLK_CLEAR_FAULT_Pos)               /*!< 0x00000010 */
#define LVDS_PSMSCCR_SLV_SER_CLK_CLEAR_FAULT                   LVDS_PSMSCCR_SLV_SER_CLK_CLEAR_FAULT_Msk                         /*!< Serializer Clock checking fault clearing */

/*****************  Bit definition for LVDS_PSMSCSR register  *****************/
#define LVDS_PSMSCSR_SLV_SER_CLK_FAULT_Pos                     (0U)
#define LVDS_PSMSCSR_SLV_SER_CLK_FAULT_Msk                     (0x1UL << LVDS_PSMSCSR_SLV_SER_CLK_FAULT_Pos)                     /*!< 0x00000001 */
#define LVDS_PSMSCSR_SLV_SER_CLK_FAULT                         LVDS_PSMSCSR_SLV_SER_CLK_FAULT_Msk                               /*!< Serializer Clock checking fault */

/*****************  Bit definition for LVDS_PSMSCR register  ******************/
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos                      (0U)
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_Msk                      (0x1FUL << LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos)                     /*!< 0x0000001F */
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ                          LVDS_PSMSCR_SLV_SER_ERROR_INJ_Msk                                /*!< Serializer error injection */
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_0                        (0x1UL << LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos)                      /*!< 0x00000001 */
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_1                        (0x2UL << LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos)                      /*!< 0x00000002 */
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_2                        (0x4UL << LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos)                      /*!< 0x00000004 */
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_3                        (0x8UL << LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos)                      /*!< 0x00000008 */
#define LVDS_PSMSCR_SLV_SER_ERROR_INJ_4                        (0x10UL << LVDS_PSMSCR_SLV_SER_ERROR_INJ_Pos)                     /*!< 0x00000010 */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos                    (8U)
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Msk                    (0x1FUL << LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos)                   /*!< 0x00001F00 */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR                        LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Msk                              /*!< Serializer fault clearing */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_0                      (0x1UL << LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000100 */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_1                      (0x2UL << LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000200 */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_2                      (0x4UL << LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000400 */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_3                      (0x8UL << LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos)                  /*!< 0x00000800 */
#define LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_4                      (0x10UL << LVDS_PSMSCR_SLV_SER_FAULT_CLEAR_Pos)                 /*!< 0x00001000 */
#define LVDS_PSMSCR_SLV_SER_LPBCK_Pos                          (16U)
#define LVDS_PSMSCR_SLV_SER_LPBCK_Msk                          (0x1FUL << LVDS_PSMSCR_SLV_SER_LPBCK_Pos)                         /*!< 0x001F0000 */
#define LVDS_PSMSCR_SLV_SER_LPBCK                              LVDS_PSMSCR_SLV_SER_LPBCK_Msk                                    /*!< Serializer fault loopback */
#define LVDS_PSMSCR_SLV_SER_LPBCK_0                            (0x1UL << LVDS_PSMSCR_SLV_SER_LPBCK_Pos)                      /*!< 0x00010000 */
#define LVDS_PSMSCR_SLV_SER_LPBCK_1                            (0x2UL << LVDS_PSMSCR_SLV_SER_LPBCK_Pos)                      /*!< 0x00020000 */
#define LVDS_PSMSCR_SLV_SER_LPBCK_2                            (0x4UL << LVDS_PSMSCR_SLV_SER_LPBCK_Pos)                      /*!< 0x00040000 */
#define LVDS_PSMSCR_SLV_SER_LPBCK_3                            (0x8UL << LVDS_PSMSCR_SLV_SER_LPBCK_Pos)                      /*!< 0x00080000 */
#define LVDS_PSMSCR_SLV_SER_LPBCK_4                            (0x10UL << LVDS_PSMSCR_SLV_SER_LPBCK_Pos)                     /*!< 0x00100000 */

