STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/****************  Bit definition for LVDS_PSPLLCR1 register  *****************/
#define LVDS_PSPLLCR1_SLV_PLL_ENABLE_Pos                       (0U)
#define LVDS_PSPLLCR1_SLV_PLL_ENABLE_Msk                       (0x1UL << LVDS_PSPLLCR1_SLV_PLL_ENABLE_Pos)                       /*!< 0x00000001 */
#define LVDS_PSPLLCR1_SLV_PLL_ENABLE                           LVDS_PSPLLCR1_SLV_PLL_ENABLE_Msk                                 /*!< 0x0: LVDS-PHY PLL Disable */
#define LVDS_PSPLLCR1_SLV_PLL_SD_ENABLE_Pos                    (1U)
#define LVDS_PSPLLCR1_SLV_PLL_SD_ENABLE_Msk                    (0x1UL << LVDS_PSPLLCR1_SLV_PLL_SD_ENABLE_Pos)                    /*!< 0x00000002 */
#define LVDS_PSPLLCR1_SLV_PLL_SD_ENABLE                        LVDS_PSPLLCR1_SLV_PLL_SD_ENABLE_Msk                              /*!< sigma-delta enable */
#define LVDS_PSPLLCR1_SLV_PLL_TWG_ENABLE_Pos                   (2U)
#define LVDS_PSPLLCR1_SLV_PLL_TWG_ENABLE_Msk                   (0x1UL << LVDS_PSPLLCR1_SLV_PLL_TWG_ENABLE_Pos)                   /*!< 0x00000004 */
#define LVDS_PSPLLCR1_SLV_PLL_TWG_ENABLE                       LVDS_PSPLLCR1_SLV_PLL_TWG_ENABLE_Msk                             /*!< Triangular wave pattern used to modulate MDIV */
#define LVDS_PSPLLCR1_SLV_PLL_BYPASS_Pos                       (4U)
#define LVDS_PSPLLCR1_SLV_PLL_BYPASS_Msk                       (0x1UL << LVDS_PSPLLCR1_SLV_PLL_BYPASS_Pos)                       /*!< 0x00000010 */
#define LVDS_PSPLLCR1_SLV_PLL_BYPASS                           LVDS_PSPLLCR1_SLV_PLL_BYPASS_Msk                                 /*!< 0x0: from VCO output */
#define LVDS_PSPLLCR1_SLV_PLL_DIVIDERS_ENABLE_Pos              (8U)
#define LVDS_PSPLLCR1_SLV_PLL_DIVIDERS_ENABLE_Msk              (0x1UL << LVDS_PSPLLCR1_SLV_PLL_DIVIDERS_ENABLE_Pos)              /*!< 0x00000100 */
#define LVDS_PSPLLCR1_SLV_PLL_DIVIDERS_ENABLE                  LVDS_PSPLLCR1_SLV_PLL_DIVIDERS_ENABLE_Msk                        /*!< 0x0: Dividers disabled */
#define LVDS_PSPLLCR1_SLV_PLL_BYPASS_START_DECT_Pos            (12U)
#define LVDS_PSPLLCR1_SLV_PLL_BYPASS_START_DECT_Msk            (0x1UL << LVDS_PSPLLCR1_SLV_PLL_BYPASS_START_DECT_Pos)            /*!< 0x00001000 */
#define LVDS_PSPLLCR1_SLV_PLL_BYPASS_START_DECT                LVDS_PSPLLCR1_SLV_PLL_BYPASS_START_DECT_Msk                      /*!< Bypass start DECT. */
#define LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Pos     (16U)
#define LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Msk     (0x1UL << LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Pos)     /*!< 0x00010000 */
#define LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_BIT_CLK_IN_SYNC         LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_BIT_CLK_IN_SYNC_Msk               /*!< Bypass control for the bit clock. */
#define LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_LS_CLK_IN_SYNC_Pos      (24U)
#define LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_LS_CLK_IN_SYNC_Msk      (0x1UL << LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_LS_CLK_IN_SYNC_Pos)      /*!< 0x01000000 */
#define LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_LS_CLK_IN_SYNC          LVDS_PSPLLCR1_SLV_LVDS_PLL_USE_LS_CLK_IN_SYNC_Msk                /*!< Bypass control for the ls clock. */

/****************  Bit definition for LVDS_PSPLLCR2 register  *****************/
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos                      (0U)
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Msk                      (0x3FFUL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                    /*!< 0x000003FF */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV                          LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Msk                                /*!< PLL Output Clock Divider (BDIV, divides output VCO) */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_0                        (0x1UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                      /*!< 0x00000001 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_1                        (0x2UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                      /*!< 0x00000002 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_2                        (0x4UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                      /*!< 0x00000004 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_3                        (0x8UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                      /*!< 0x00000008 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_4                        (0x10UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                     /*!< 0x00000010 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_5                        (0x20UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                     /*!< 0x00000020 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_6                        (0x40UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                     /*!< 0x00000040 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_7                        (0x80UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                     /*!< 0x00000080 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_8                        (0x100UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                    /*!< 0x00000100 */
#define LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_9                        (0x200UL << LVDS_PSPLLCR2_SLV_PLL_BIT_DIV_Pos)                    /*!< 0x00000200 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos                    (16U)
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Msk                    (0x3FFUL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)                  /*!< 0x03FF0000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV                        LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Msk                              /*!< PLL Input Clock Divider (NDIV, divides input reference clock) */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_0                      (0x1UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)                /*!< 0x00010000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_1                      (0x2UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)                /*!< 0x00020000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_2                      (0x4UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)                /*!< 0x00040000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_3                      (0x8UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)                /*!< 0x00080000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_4                      (0x10UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)               /*!< 0x00100000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_5                      (0x20UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)               /*!< 0x00200000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_6                      (0x40UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)               /*!< 0x00400000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_7                      (0x80UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)               /*!< 0x00800000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_8                      (0x100UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)              /*!< 0x01000000 */
#define LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_9                      (0x200UL << LVDS_PSPLLCR2_SLV_PLL_INPUT_DIV_Pos)              /*!< 0x02000000 */

