STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/*****************  Bit definition for LVDS_PMDTCR2 register  *****************/
#define LVDS_PMDTCR2_PMDTDL4_Pos                               (0U)
#define LVDS_PMDTCR2_PMDTDL4_Msk                               (0xFFUL << LVDS_PMDTCR2_PMDTDL4_Pos)                              /*!< 0x000000FF */
#define LVDS_PMDTCR2_PMDTDL4                                   LVDS_PMDTCR2_PMDTDL4_Msk                                         /*!< PHY Master Digital Test Data Lane 4. */
#define LVDS_PMDTCR2_PMDTDL4_0                                 (0x1UL << LVDS_PMDTCR2_PMDTDL4_Pos)                               /*!< 0x00000001 */
#define LVDS_PMDTCR2_PMDTDL4_1                                 (0x2UL << LVDS_PMDTCR2_PMDTDL4_Pos)                               /*!< 0x00000002 */
#define LVDS_PMDTCR2_PMDTDL4_2                                 (0x4UL << LVDS_PMDTCR2_PMDTDL4_Pos)                               /*!< 0x00000004 */
#define LVDS_PMDTCR2_PMDTDL4_3                                 (0x8UL << LVDS_PMDTCR2_PMDTDL4_Pos)                               /*!< 0x00000008 */
#define LVDS_PMDTCR2_PMDTDL4_4                                 (0x10UL << LVDS_PMDTCR2_PMDTDL4_Pos)                              /*!< 0x00000010 */
#define LVDS_PMDTCR2_PMDTDL4_5                                 (0x20UL << LVDS_PMDTCR2_PMDTDL4_Pos)                              /*!< 0x00000020 */
#define LVDS_PMDTCR2_PMDTDL4_6                                 (0x40UL << LVDS_PMDTCR2_PMDTDL4_Pos)                              /*!< 0x00000040 */
#define LVDS_PMDTCR2_PMDTDL4_7                                 (0x80UL << LVDS_PMDTCR2_PMDTDL4_Pos)                              /*!< 0x00000080 */
#define LVDS_PMDTCR2_PMDTMC_Pos                                (8U)
#define LVDS_PMDTCR2_PMDTMC_Msk                                (0x7FUL << LVDS_PMDTCR2_PMDTMC_Pos)                               /*!< 0x00007F00 */
#define LVDS_PMDTCR2_PMDTMC                                    LVDS_PMDTCR2_PMDTMC_Msk                                          /*!< Phy Master Digital Test Mux Control */
#define LVDS_PMDTCR2_PMDTMC_0                                  (0x1UL << LVDS_PMDTCR2_PMDTMC_Pos)                              /*!< 0x00000100 */
#define LVDS_PMDTCR2_PMDTMC_1                                  (0x2UL << LVDS_PMDTCR2_PMDTMC_Pos)                              /*!< 0x00000200 */
#define LVDS_PMDTCR2_PMDTMC_2                                  (0x4UL << LVDS_PMDTCR2_PMDTMC_Pos)                              /*!< 0x00000400 */
#define LVDS_PMDTCR2_PMDTMC_3                                  (0x8UL << LVDS_PMDTCR2_PMDTMC_Pos)                              /*!< 0x00000800 */
#define LVDS_PMDTCR2_PMDTMC_4                                  (0x10UL << LVDS_PMDTCR2_PMDTMC_Pos)                             /*!< 0x00001000 */
#define LVDS_PMDTCR2_PMDTMC_5                                  (0x20UL << LVDS_PMDTCR2_PMDTMC_Pos)                             /*!< 0x00002000 */
#define LVDS_PMDTCR2_PMDTMC_6                                  (0x40UL << LVDS_PMDTCR2_PMDTMC_Pos)                             /*!< 0x00004000 */

/*****************  Bit definition for LVDS_PMDTSR register  ******************/
#define LVDS_PMDTSR_PMDTDLS0_Pos                               (0U)
#define LVDS_PMDTSR_PMDTDLS0_Msk                               (0x1UL << LVDS_PMDTSR_PMDTDLS0_Pos)                               /*!< 0x00000001 */
#define LVDS_PMDTSR_PMDTDLS0                                   LVDS_PMDTSR_PMDTDLS0_Msk                                         /*!< Phy Master Digital Test Data Lane Status 0. */
#define LVDS_PMDTSR_PMDTDLS1_Pos                               (1U)
#define LVDS_PMDTSR_PMDTDLS1_Msk                               (0x1UL << LVDS_PMDTSR_PMDTDLS1_Pos)                               /*!< 0x00000002 */
#define LVDS_PMDTSR_PMDTDLS1                                   LVDS_PMDTSR_PMDTDLS1_Msk                                         /*!< Phy Master Digital Test Data Lane Status 1. */
#define LVDS_PMDTSR_PMDTDLS2_Pos                               (2U)
#define LVDS_PMDTSR_PMDTDLS2_Msk                               (0x1UL << LVDS_PMDTSR_PMDTDLS2_Pos)                               /*!< 0x00000004 */
#define LVDS_PMDTSR_PMDTDLS2                                   LVDS_PMDTSR_PMDTDLS2_Msk                                         /*!< Phy Master Digital Test Data Lane Status 2. */
#define LVDS_PMDTSR_PMDTDLS3_Pos                               (3U)
#define LVDS_PMDTSR_PMDTDLS3_Msk                               (0x1UL << LVDS_PMDTSR_PMDTDLS3_Pos)                               /*!< 0x00000008 */
#define LVDS_PMDTSR_PMDTDLS3                                   LVDS_PMDTSR_PMDTDLS3_Msk                                         /*!< Phy Master Digital Test Data Lane Status 3. */
#define LVDS_PMDTSR_PMDTDLS4_Pos                               (4U)
#define LVDS_PMDTSR_PMDTDLS4_Msk                               (0x1UL << LVDS_PMDTSR_PMDTDLS4_Pos)                               /*!< 0x00000010 */
#define LVDS_PMDTSR_PMDTDLS4                                   LVDS_PMDTSR_PMDTDLS4_Msk                                         /*!< Phy Master Digital Test Data Lane Status 4. */
#define LVDS_PMDTSR_PMDTPS_Pos                                 (5U)
#define LVDS_PMDTSR_PMDTPS_Msk                                 (0x1UL << LVDS_PMDTSR_PMDTPS_Pos)                                 /*!< 0x00000020 */
#define LVDS_PMDTSR_PMDTPS                                     LVDS_PMDTSR_PMDTPS_Msk                                           /*!< Phy Master Digital Test PLL Status */

/*****************  Bit definition for LVDS_PSATCR1 register  *****************/
#define LVDS_PSATCR1_PSATDL0_Pos                               (0U)
#define LVDS_PSATCR1_PSATDL0_Msk                               (0xFFUL << LVDS_PSATCR1_PSATDL0_Pos)                              /*!< 0x000000FF */
#define LVDS_PSATCR1_PSATDL0                                   LVDS_PSATCR1_PSATDL0_Msk                                         /*!< PHY Slave Analog Test Data Lane 0. */
#define LVDS_PSATCR1_PSATDL0_0                                 (0x1UL << LVDS_PSATCR1_PSATDL0_Pos)                               /*!< 0x00000001 */
#define LVDS_PSATCR1_PSATDL0_1                                 (0x2UL << LVDS_PSATCR1_PSATDL0_Pos)                               /*!< 0x00000002 */
#define LVDS_PSATCR1_PSATDL0_2                                 (0x4UL << LVDS_PSATCR1_PSATDL0_Pos)                               /*!< 0x00000004 */
#define LVDS_PSATCR1_PSATDL0_3                                 (0x8UL << LVDS_PSATCR1_PSATDL0_Pos)                               /*!< 0x00000008 */
#define LVDS_PSATCR1_PSATDL0_4                                 (0x10UL << LVDS_PSATCR1_PSATDL0_Pos)                              /*!< 0x00000010 */
#define LVDS_PSATCR1_PSATDL0_5                                 (0x20UL << LVDS_PSATCR1_PSATDL0_Pos)                              /*!< 0x00000020 */
#define LVDS_PSATCR1_PSATDL0_6                                 (0x40UL << LVDS_PSATCR1_PSATDL0_Pos)                              /*!< 0x00000040 */
#define LVDS_PSATCR1_PSATDL0_7                                 (0x80UL << LVDS_PSATCR1_PSATDL0_Pos)                              /*!< 0x00000080 */
#define LVDS_PSATCR1_PSATDL1_Pos                               (8U)
#define LVDS_PSATCR1_PSATDL1_Msk                               (0xFFUL << LVDS_PSATCR1_PSATDL1_Pos)                              /*!< 0x0000FF00 */
#define LVDS_PSATCR1_PSATDL1                                   LVDS_PSATCR1_PSATDL1_Msk                                         /*!< PHY Slave Analog Test Data Lane 1. */
#define LVDS_PSATCR1_PSATDL1_0                                 (0x1UL << LVDS_PSATCR1_PSATDL1_Pos)                             /*!< 0x00000100 */
#define LVDS_PSATCR1_PSATDL1_1                                 (0x2UL << LVDS_PSATCR1_PSATDL1_Pos)                             /*!< 0x00000200 */
#define LVDS_PSATCR1_PSATDL1_2                                 (0x4UL << LVDS_PSATCR1_PSATDL1_Pos)                             /*!< 0x00000400 */
#define LVDS_PSATCR1_PSATDL1_3                                 (0x8UL << LVDS_PSATCR1_PSATDL1_Pos)                             /*!< 0x00000800 */
#define LVDS_PSATCR1_PSATDL1_4                                 (0x10UL << LVDS_PSATCR1_PSATDL1_Pos)                            /*!< 0x00001000 */
#define LVDS_PSATCR1_PSATDL1_5                                 (0x20UL << LVDS_PSATCR1_PSATDL1_Pos)                            /*!< 0x00002000 */
#define LVDS_PSATCR1_PSATDL1_6                                 (0x40UL << LVDS_PSATCR1_PSATDL1_Pos)                            /*!< 0x00004000 */
#define LVDS_PSATCR1_PSATDL1_7                                 (0x80UL << LVDS_PSATCR1_PSATDL1_Pos)                            /*!< 0x00008000 */
#define LVDS_PSATCR1_PSATDL2_Pos                               (16U)
#define LVDS_PSATCR1_PSATDL2_Msk                               (0xFFUL << LVDS_PSATCR1_PSATDL2_Pos)                              /*!< 0x00FF0000 */
#define LVDS_PSATCR1_PSATDL2                                   LVDS_PSATCR1_PSATDL2_Msk                                         /*!< PHY Slave Analog Test Data Lane 2. */
#define LVDS_PSATCR1_PSATDL2_0                                 (0x1UL << LVDS_PSATCR1_PSATDL2_Pos)                           /*!< 0x00010000 */
#define LVDS_PSATCR1_PSATDL2_1                                 (0x2UL << LVDS_PSATCR1_PSATDL2_Pos)                           /*!< 0x00020000 */
#define LVDS_PSATCR1_PSATDL2_2                                 (0x4UL << LVDS_PSATCR1_PSATDL2_Pos)                           /*!< 0x00040000 */
#define LVDS_PSATCR1_PSATDL2_3                                 (0x8UL << LVDS_PSATCR1_PSATDL2_Pos)                           /*!< 0x00080000 */
#define LVDS_PSATCR1_PSATDL2_4                                 (0x10UL << LVDS_PSATCR1_PSATDL2_Pos)                          /*!< 0x00100000 */
#define LVDS_PSATCR1_PSATDL2_5                                 (0x20UL << LVDS_PSATCR1_PSATDL2_Pos)                          /*!< 0x00200000 */
#define LVDS_PSATCR1_PSATDL2_6                                 (0x40UL << LVDS_PSATCR1_PSATDL2_Pos)                          /*!< 0x00400000 */
#define LVDS_PSATCR1_PSATDL2_7                                 (0x80UL << LVDS_PSATCR1_PSATDL2_Pos)                          /*!< 0x00800000 */
#define LVDS_PSATCR1_PSATDL3_Pos                               (24U)
#define LVDS_PSATCR1_PSATDL3_Msk                               (0xFFUL << LVDS_PSATCR1_PSATDL3_Pos)                              /*!< 0xFF000000 */
#define LVDS_PSATCR1_PSATDL3                                   LVDS_PSATCR1_PSATDL3_Msk                                         /*!< PHY Slave Analog Test Data Lane 3. */
#define LVDS_PSATCR1_PSATDL3_0                                 (0x1UL << LVDS_PSATCR1_PSATDL3_Pos)                         /*!< 0x01000000 */
#define LVDS_PSATCR1_PSATDL3_1                                 (0x2UL << LVDS_PSATCR1_PSATDL3_Pos)                         /*!< 0x02000000 */
#define LVDS_PSATCR1_PSATDL3_2                                 (0x4UL << LVDS_PSATCR1_PSATDL3_Pos)                         /*!< 0x04000000 */
#define LVDS_PSATCR1_PSATDL3_3                                 (0x8UL << LVDS_PSATCR1_PSATDL3_Pos)                         /*!< 0x08000000 */
#define LVDS_PSATCR1_PSATDL3_4                                 (0x10UL << LVDS_PSATCR1_PSATDL3_Pos)                        /*!< 0x10000000 */
#define LVDS_PSATCR1_PSATDL3_5                                 (0x20UL << LVDS_PSATCR1_PSATDL3_Pos)                        /*!< 0x20000000 */
#define LVDS_PSATCR1_PSATDL3_6                                 (0x40UL << LVDS_PSATCR1_PSATDL3_Pos)                        /*!< 0x40000000 */
#define LVDS_PSATCR1_PSATDL3_7                                 (0x80UL << LVDS_PSATCR1_PSATDL3_Pos)                        /*!< 0x80000000 */

/*****************  Bit definition for LVDS_PSATCR2 register  *****************/
#define LVDS_PSATCR2_PSATDL4_Pos                               (0U)
#define LVDS_PSATCR2_PSATDL4_Msk                               (0xFFUL << LVDS_PSATCR2_PSATDL4_Pos)                              /*!< 0x000000FF */
#define LVDS_PSATCR2_PSATDL4                                   LVDS_PSATCR2_PSATDL4_Msk                                         /*!< PHY Slave Analog Test Data Lane 4. */
#define LVDS_PSATCR2_PSATDL4_0                                 (0x1UL << LVDS_PSATCR2_PSATDL4_Pos)                               /*!< 0x00000001 */
#define LVDS_PSATCR2_PSATDL4_1                                 (0x2UL << LVDS_PSATCR2_PSATDL4_Pos)                               /*!< 0x00000002 */
#define LVDS_PSATCR2_PSATDL4_2                                 (0x4UL << LVDS_PSATCR2_PSATDL4_Pos)                               /*!< 0x00000004 */
#define LVDS_PSATCR2_PSATDL4_3                                 (0x8UL << LVDS_PSATCR2_PSATDL4_Pos)                               /*!< 0x00000008 */
#define LVDS_PSATCR2_PSATDL4_4                                 (0x10UL << LVDS_PSATCR2_PSATDL4_Pos)                              /*!< 0x00000010 */
#define LVDS_PSATCR2_PSATDL4_5                                 (0x20UL << LVDS_PSATCR2_PSATDL4_Pos)                              /*!< 0x00000020 */
#define LVDS_PSATCR2_PSATDL4_6                                 (0x40UL << LVDS_PSATCR2_PSATDL4_Pos)                              /*!< 0x00000040 */
#define LVDS_PSATCR2_PSATDL4_7                                 (0x80UL << LVDS_PSATCR2_PSATDL4_Pos)                              /*!< 0x00000080 */
#define LVDS_PSATCR2_PSATB_Pos                                 (8U)
#define LVDS_PSATCR2_PSATB_Msk                                 (0xFFUL << LVDS_PSATCR2_PSATB_Pos)                                /*!< 0x0000FF00 */
#define LVDS_PSATCR2_PSATB                                     LVDS_PSATCR2_PSATB_Msk                                           /*!< Phy Slave Analog Test Bias */
#define LVDS_PSATCR2_PSATB_0                                   (0x1UL << LVDS_PSATCR2_PSATB_Pos)                               /*!< 0x00000100 */
#define LVDS_PSATCR2_PSATB_1                                   (0x2UL << LVDS_PSATCR2_PSATB_Pos)                               /*!< 0x00000200 */
#define LVDS_PSATCR2_PSATB_2                                   (0x4UL << LVDS_PSATCR2_PSATB_Pos)                               /*!< 0x00000400 */
#define LVDS_PSATCR2_PSATB_3                                   (0x8UL << LVDS_PSATCR2_PSATB_Pos)                               /*!< 0x00000800 */
#define LVDS_PSATCR2_PSATB_4                                   (0x10UL << LVDS_PSATCR2_PSATB_Pos)                              /*!< 0x00001000 */
#define LVDS_PSATCR2_PSATB_5                                   (0x20UL << LVDS_PSATCR2_PSATB_Pos)                              /*!< 0x00002000 */
#define LVDS_PSATCR2_PSATB_6                                   (0x40UL << LVDS_PSATCR2_PSATB_Pos)                              /*!< 0x00004000 */
#define LVDS_PSATCR2_PSATB_7                                   (0x80UL << LVDS_PSATCR2_PSATB_Pos)                              /*!< 0x00008000 */
#define LVDS_PSATCR2_PSATPC_Pos                                (16U)
#define LVDS_PSATCR2_PSATPC_Msk                                (0x7FUL << LVDS_PSATCR2_PSATPC_Pos)                               /*!< 0x007F0000 */
#define LVDS_PSATCR2_PSATPC                                    LVDS_PSATCR2_PSATPC_Msk                                          /*!< Phy Slave Analog Test PLL Control */
#define LVDS_PSATCR2_PSATPC_0                                  (0x1UL << LVDS_PSATCR2_PSATPC_Pos)                            /*!< 0x00010000 */
#define LVDS_PSATCR2_PSATPC_1                                  (0x2UL << LVDS_PSATCR2_PSATPC_Pos)                            /*!< 0x00020000 */
#define LVDS_PSATCR2_PSATPC_2                                  (0x4UL << LVDS_PSATCR2_PSATPC_Pos)                            /*!< 0x00040000 */
#define LVDS_PSATCR2_PSATPC_3                                  (0x8UL << LVDS_PSATCR2_PSATPC_Pos)                            /*!< 0x00080000 */
#define LVDS_PSATCR2_PSATPC_4                                  (0x10UL << LVDS_PSATCR2_PSATPC_Pos)                           /*!< 0x00100000 */
#define LVDS_PSATCR2_PSATPC_5                                  (0x20UL << LVDS_PSATCR2_PSATPC_Pos)                           /*!< 0x00200000 */
#define LVDS_PSATCR2_PSATPC_6                                  (0x40UL << LVDS_PSATCR2_PSATPC_Pos)                           /*!< 0x00400000 */

/*****************  Bit definition for LVDS_PSDTCR1 register  *****************/
#define LVDS_PSDTCR1_PSDTDL0_Pos                               (0U)
#define LVDS_PSDTCR1_PSDTDL0_Msk                               (0xFFUL << LVDS_PSDTCR1_PSDTDL0_Pos)                              /*!< 0x000000FF */
#define LVDS_PSDTCR1_PSDTDL0                                   LVDS_PSDTCR1_PSDTDL0_Msk                                         /*!< PHY Slave Digital Test Data Lane 0. */
#define LVDS_PSDTCR1_PSDTDL0_0                                 (0x1UL << LVDS_PSDTCR1_PSDTDL0_Pos)                               /*!< 0x00000001 */
#define LVDS_PSDTCR1_PSDTDL0_1                                 (0x2UL << LVDS_PSDTCR1_PSDTDL0_Pos)                               /*!< 0x00000002 */
#define LVDS_PSDTCR1_PSDTDL0_2                                 (0x4UL << LVDS_PSDTCR1_PSDTDL0_Pos)                               /*!< 0x00000004 */
#define LVDS_PSDTCR1_PSDTDL0_3                                 (0x8UL << LVDS_PSDTCR1_PSDTDL0_Pos)                               /*!< 0x00000008 */
#define LVDS_PSDTCR1_PSDTDL0_4                                 (0x10UL << LVDS_PSDTCR1_PSDTDL0_Pos)                              /*!< 0x00000010 */
#define LVDS_PSDTCR1_PSDTDL0_5                                 (0x20UL << LVDS_PSDTCR1_PSDTDL0_Pos)                              /*!< 0x00000020 */
#define LVDS_PSDTCR1_PSDTDL0_6                                 (0x40UL << LVDS_PSDTCR1_PSDTDL0_Pos)                              /*!< 0x00000040 */
#define LVDS_PSDTCR1_PSDTDL0_7                                 (0x80UL << LVDS_PSDTCR1_PSDTDL0_Pos)                              /*!< 0x00000080 */
#define LVDS_PSDTCR1_PSDTDL1_Pos                               (8U)
#define LVDS_PSDTCR1_PSDTDL1_Msk                               (0xFFUL << LVDS_PSDTCR1_PSDTDL1_Pos)                              /*!< 0x0000FF00 */
#define LVDS_PSDTCR1_PSDTDL1                                   LVDS_PSDTCR1_PSDTDL1_Msk                                         /*!< PHY Slave Digital Test Data Lane 1. */
#define LVDS_PSDTCR1_PSDTDL1_0                                 (0x1UL << LVDS_PSDTCR1_PSDTDL1_Pos)                             /*!< 0x00000100 */
#define LVDS_PSDTCR1_PSDTDL1_1                                 (0x2UL << LVDS_PSDTCR1_PSDTDL1_Pos)                             /*!< 0x00000200 */
#define LVDS_PSDTCR1_PSDTDL1_2                                 (0x4UL << LVDS_PSDTCR1_PSDTDL1_Pos)                             /*!< 0x00000400 */
#define LVDS_PSDTCR1_PSDTDL1_3                                 (0x8UL << LVDS_PSDTCR1_PSDTDL1_Pos)                             /*!< 0x00000800 */
#define LVDS_PSDTCR1_PSDTDL1_4                                 (0x10UL << LVDS_PSDTCR1_PSDTDL1_Pos)                            /*!< 0x00001000 */
#define LVDS_PSDTCR1_PSDTDL1_5                                 (0x20UL << LVDS_PSDTCR1_PSDTDL1_Pos)                            /*!< 0x00002000 */
#define LVDS_PSDTCR1_PSDTDL1_6                                 (0x40UL << LVDS_PSDTCR1_PSDTDL1_Pos)                            /*!< 0x00004000 */
#define LVDS_PSDTCR1_PSDTDL1_7                                 (0x80UL << LVDS_PSDTCR1_PSDTDL1_Pos)                            /*!< 0x00008000 */
#define LVDS_PSDTCR1_PSDTDL2_Pos                               (16U)
#define LVDS_PSDTCR1_PSDTDL2_Msk                               (0xFFUL << LVDS_PSDTCR1_PSDTDL2_Pos)                              /*!< 0x00FF0000 */
#define LVDS_PSDTCR1_PSDTDL2                                   LVDS_PSDTCR1_PSDTDL2_Msk                                         /*!< PHY Slave Digital Test Data Lane 2. */
#define LVDS_PSDTCR1_PSDTDL2_0                                 (0x1UL << LVDS_PSDTCR1_PSDTDL2_Pos)                           /*!< 0x00010000 */
#define LVDS_PSDTCR1_PSDTDL2_1                                 (0x2UL << LVDS_PSDTCR1_PSDTDL2_Pos)                           /*!< 0x00020000 */
#define LVDS_PSDTCR1_PSDTDL2_2                                 (0x4UL << LVDS_PSDTCR1_PSDTDL2_Pos)                           /*!< 0x00040000 */
#define LVDS_PSDTCR1_PSDTDL2_3                                 (0x8UL << LVDS_PSDTCR1_PSDTDL2_Pos)                           /*!< 0x00080000 */
#define LVDS_PSDTCR1_PSDTDL2_4                                 (0x10UL << LVDS_PSDTCR1_PSDTDL2_Pos)                          /*!< 0x00100000 */
#define LVDS_PSDTCR1_PSDTDL2_5                                 (0x20UL << LVDS_PSDTCR1_PSDTDL2_Pos)                          /*!< 0x00200000 */
#define LVDS_PSDTCR1_PSDTDL2_6                                 (0x40UL << LVDS_PSDTCR1_PSDTDL2_Pos)                          /*!< 0x00400000 */
#define LVDS_PSDTCR1_PSDTDL2_7                                 (0x80UL << LVDS_PSDTCR1_PSDTDL2_Pos)                          /*!< 0x00800000 */
#define LVDS_PSDTCR1_PSDTDL3_Pos                               (24U)
#define LVDS_PSDTCR1_PSDTDL3_Msk                               (0xFFUL << LVDS_PSDTCR1_PSDTDL3_Pos)                              /*!< 0xFF000000 */
#define LVDS_PSDTCR1_PSDTDL3                                   LVDS_PSDTCR1_PSDTDL3_Msk                                         /*!< PHY Slave Digital Test Data Lane 3. */
#define LVDS_PSDTCR1_PSDTDL3_0                                 (0x1UL << LVDS_PSDTCR1_PSDTDL3_Pos)                         /*!< 0x01000000 */
#define LVDS_PSDTCR1_PSDTDL3_1                                 (0x2UL << LVDS_PSDTCR1_PSDTDL3_Pos)                         /*!< 0x02000000 */
#define LVDS_PSDTCR1_PSDTDL3_2                                 (0x4UL << LVDS_PSDTCR1_PSDTDL3_Pos)                         /*!< 0x04000000 */
#define LVDS_PSDTCR1_PSDTDL3_3                                 (0x8UL << LVDS_PSDTCR1_PSDTDL3_Pos)                         /*!< 0x08000000 */
#define LVDS_PSDTCR1_PSDTDL3_4                                 (0x10UL << LVDS_PSDTCR1_PSDTDL3_Pos)                        /*!< 0x10000000 */
#define LVDS_PSDTCR1_PSDTDL3_5                                 (0x20UL << LVDS_PSDTCR1_PSDTDL3_Pos)                        /*!< 0x20000000 */
#define LVDS_PSDTCR1_PSDTDL3_6                                 (0x40UL << LVDS_PSDTCR1_PSDTDL3_Pos)                        /*!< 0x40000000 */
#define LVDS_PSDTCR1_PSDTDL3_7                                 (0x80UL << LVDS_PSDTCR1_PSDTDL3_Pos)                        /*!< 0x80000000 */

