STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/****************  Bit definition for OCTOSPI_WIR register  *******************/
#define OCTOSPI_WIR_INSTRUCTION_Pos    (0U)
#define OCTOSPI_WIR_INSTRUCTION_Msk    (0xFFFFFFFFUL << OCTOSPI_WIR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WIR_INSTRUCTION        OCTOSPI_WIR_INSTRUCTION_Msk             /*!< Instruction */

/****************  Bit definition for OCTOSPI_WABR register  ******************/
#define OCTOSPI_WABR_ALTERNATE_Pos     (0U)
#define OCTOSPI_WABR_ALTERNATE_Msk     (0xFFFFFFFFUL << OCTOSPI_WABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WABR_ALTERNATE         OCTOSPI_WABR_ALTERNATE_Msk              /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_HLCR register  ******************/
#define OCTOSPI_HLCR_LM_Pos            (0U)
#define OCTOSPI_HLCR_LM_Msk            (0x1UL << OCTOSPI_HLCR_LM_Pos)           /*!< 0x00000001 */
#define OCTOSPI_HLCR_LM                OCTOSPI_HLCR_LM_Msk                     /*!< Latency Mode */
#define OCTOSPI_HLCR_WZL_Pos           (1U)
#define OCTOSPI_HLCR_WZL_Msk           (0x1UL << OCTOSPI_HLCR_WZL_Pos)          /*!< 0x00000002 */
#define OCTOSPI_HLCR_WZL               OCTOSPI_HLCR_WZL_Msk                    /*!< Write Zero Latency */
#define OCTOSPI_HLCR_TACC_Pos          (8U)
#define OCTOSPI_HLCR_TACC_Msk          (0xFFUL << OCTOSPI_HLCR_TACC_Pos)        /*!< 0x0000FF00 */
#define OCTOSPI_HLCR_TACC              OCTOSPI_HLCR_TACC_Msk                   /*!< Access Time */
#define OCTOSPI_HLCR_TRWR_Pos          (16U)
#define OCTOSPI_HLCR_TRWR_Msk          (0xFFUL << OCTOSPI_HLCR_TRWR_Pos)        /*!< 0x00FF0000 */
#define OCTOSPI_HLCR_TRWR              OCTOSPI_HLCR_TRWR_Msk                   /*!< Read Write Recovery Time */

/***************  Bit definition for OCTOSPI_HWCFGR2 register  ****************/
#define OCTOSPI_HWCFGR2_FRCK_Pos         (0U)
#define OCTOSPI_HWCFGR2_FRCK_Msk         (0xFUL << OCTOSPI_HWCFGR2_FRCK_Pos)            /*!< 0x0000000F */
#define OCTOSPI_HWCFGR2_FRCK             OCTOSPI_HWCFGR2_FRCK_Msk                      /*!< Free running clock */
#define OCTOSPI_HWCFGR2_RDFT_Pos         (4U)
#define OCTOSPI_HWCFGR2_RDFT_Msk         (0xFUL << OCTOSPI_HWCFGR2_RDFT_Pos)            /*!< 0x000000F0 */
#define OCTOSPI_HWCFGR2_RDFT             OCTOSPI_HWCFGR2_RDFT_Msk                      /*!< Reduced features */
#define OCTOSPI_HWCFGR2_ARBM_Pos         (8U)
#define OCTOSPI_HWCFGR2_ARBM_Msk         (0xFUL << OCTOSPI_HWCFGR2_ARBM_Pos)            /*!< 0x00000F00 */
#define OCTOSPI_HWCFGR2_ARBM             OCTOSPI_HWCFGR2_ARBM_Msk                      /*!< Arbitration configuration */
#define OCTOSPI_HWCFGR2_MEM16_Pos        (12U)
#define OCTOSPI_HWCFGR2_MEM16_Msk        (0xFUL << OCTOSPI_HWCFGR2_MEM16_Pos)           /*!< 0x0000F000 */
#define OCTOSPI_HWCFGR2_MEM16            OCTOSPI_HWCFGR2_MEM16_Msk                     /*!< Size of the SPI memory supported */
#define OCTOSPI_HWCFGR2_HSINT_Pos        (16U)
#define OCTOSPI_HWCFGR2_HSINT_Msk        (0xFUL << OCTOSPI_HWCFGR2_HSINT_Pos)           /*!< 0x000F0000 */
#define OCTOSPI_HWCFGR2_HSINT            OCTOSPI_HWCFGR2_HSINT_Msk                     /*!< High-speed interface */

/****************  Bit definition for OCTOSPI_HWCFGR register  ****************/
#define OCTOSPI_HWCFGR_AXI_Pos           (0U)
#define OCTOSPI_HWCFGR_AXI_Msk           (0xFUL << OCTOSPI_HWCFGR_AXI_Pos)              /*!< 0x0000000F */
#define OCTOSPI_HWCFGR_AXI               OCTOSPI_HWCFGR_AXI_Msk                        /*!< OCTOSPI interface */
#define OCTOSPI_HWCFGR_FIFO_Pos          (4U)
#define OCTOSPI_HWCFGR_FIFO_Msk          (0xFFUL << OCTOSPI_HWCFGR_FIFO_Pos)            /*!< 0x00000FF0 */
#define OCTOSPI_HWCFGR_FIFO              OCTOSPI_HWCFGR_FIFO_Msk                       /*!< FIFO depth */
#define OCTOSPI_HWCFGR_PRES_Pos          (12U)
#define OCTOSPI_HWCFGR_PRES_Msk          (0xFFUL << OCTOSPI_HWCFGR_PRES_Pos)            /*!< 0x000FF000 */
#define OCTOSPI_HWCFGR_PRES              OCTOSPI_HWCFGR_PRES_Msk                       /*!< Prescaler */
#define OCTOSPI_HWCFGR_IDL_Pos           (20U)
#define OCTOSPI_HWCFGR_IDL_Msk           (0xFUL << OCTOSPI_HWCFGR_IDL_Pos)              /*!< 0x00F00000 */
#define OCTOSPI_HWCFGR_IDL               OCTOSPI_HWCFGR_IDL_Msk                        /*!< ID Length */
#define OCTOSPI_HWCFGR_MMW_Pos           (24U)
#define OCTOSPI_HWCFGR_MMW_Msk           (0xFUL << OCTOSPI_HWCFGR_MMW_Pos)              /*!< 0x0F000000 */
#define OCTOSPI_HWCFGR_MMW               OCTOSPI_HWCFGR_MMW_Msk                        /*!< Memory-mapped write */
#define OCTOSPI_HWCFGR_CSSRV_Pos         (28U)
#define OCTOSPI_HWCFGR_CSSRV_Msk         (0xFUL << OCTOSPI_HWCFGR_CSSRV_Pos)            /*!< 0xF0000000 */
#define OCTOSPI_HWCFGR_CSSRV             OCTOSPI_HWCFGR_CSSRV_Msk                      /*!< CSSEL reset value */

/****************  Bit definition for OCTOSPI_VER register  *******************/
#define OCTOSPI_VER_VER_Pos            (0U)
#define OCTOSPI_VER_VER_Msk            (0xFFUL << OCTOSPI_VER_VER_Pos)          /*!< 0x000000FF */
#define OCTOSPI_VER_VER                OCTOSPI_VER_VER_Msk                     /*!< Version */

/*****************  Bit definition for OCTOSPI_ID register  *******************/
#define OCTOSPI_ID_ID_Pos              (0U)
#define OCTOSPI_ID_ID_Msk              (0xFFFFFFFFUL << OCTOSPI_ID_ID_Pos)      /*!< 0xFFFFFFFF */
#define OCTOSPI_ID_ID                  OCTOSPI_ID_ID_Msk                       /*!< Identification */

/****************  Bit definition for OCTOSPI_MID register  *******************/
#define OCTOSPI_MID_MID_Pos            (0U)
#define OCTOSPI_MID_MID_Msk            (0xFFFFFFFFUL << OCTOSPI_MID_MID_Pos)    /*!< 0xFFFFFFFF */
#define OCTOSPI_MID_MID                OCTOSPI_MID_MID_Msk                     /*!< Magic ID */

/******************************************************************************/
/*                                                                            */
/*                                  OCTOSPIM                                  */
/*                                                                            */
/******************************************************************************/
/***************  Bit definition for OCTOSPIM_CR register  ********************/
#define OCTOSPIM_CR_MUXEN_Pos             (0U)
#define OCTOSPIM_CR_MUXEN_Msk             (0x1UL << OCTOSPIM_CR_MUXEN_Pos)                 /*!< 0x00000001 */
#define OCTOSPIM_CR_MUXEN                 OCTOSPIM_CR_MUXEN_Msk                           /*!< Multiplexed mode enable */
#define OCTOSPIM_CR_MODE_Pos              (1U)
#define OCTOSPIM_CR_MODE_Msk              (0x1UL << OCTOSPIM_CR_MODE_Pos)                  /*!< 0x00000002 */
#define OCTOSPIM_CR_MODE                  OCTOSPIM_CR_MODE_Msk                            /*!< OCTOSPIM multiplexing mode */
#define OCTOSPIM_CR_CSSEL_OVR_EN_Pos      (4U)
#define OCTOSPIM_CR_CSSEL_OVR_EN_Msk      (0x1UL << OCTOSPIM_CR_CSSEL_OVR_EN_Pos)          /*!< 0x00000010 */
#define OCTOSPIM_CR_CSSEL_OVR_EN          OCTOSPIM_CR_CSSEL_OVR_EN_Msk                    /*!< Chip select selector override enable */
#define OCTOSPIM_CR_CSSEL_OVR_O1_Pos      (5U)
#define OCTOSPIM_CR_CSSEL_OVR_O1_Msk      (0x1UL << OCTOSPIM_CR_CSSEL_OVR_O1_Pos)          /*!< 0x00000020 */
#define OCTOSPIM_CR_CSSEL_OVR_O1          OCTOSPIM_CR_CSSEL_OVR_O1_Msk                    /*!< Chip select selector override setting for OCTOSPI1 */
#define OCTOSPIM_CR_CSSEL_OVR_O2_Pos      (6U)
#define OCTOSPIM_CR_CSSEL_OVR_O2_Msk      (0x1UL << OCTOSPIM_CR_CSSEL_OVR_O2_Pos)          /*!< 0x00000040 */
#define OCTOSPIM_CR_CSSEL_OVR_O2          OCTOSPIM_CR_CSSEL_OVR_O2_Msk                    /*!< Chip select selector override setting for OCTOSPI2 */
#define OCTOSPIM_CR_REQ2ACK_TIME_Pos      (16U)
#define OCTOSPIM_CR_REQ2ACK_TIME_Msk      (0xFFUL << OCTOSPIM_CR_REQ2ACK_TIME_Pos)         /*!< 0x00FF0000 */
#define OCTOSPIM_CR_REQ2ACK_TIME          OCTOSPIM_CR_REQ2ACK_TIME_Msk                    /*!< REQ to ACK time */

/***************  Bit definition for OCTOSPIM_HWCFGR register  ****************/
#define OCTOSPIM_HWCFGR_NUM_PORT_Pos      (0U)
#define OCTOSPIM_HWCFGR_NUM_PORT_Msk      (0xFUL << OCTOSPIM_HWCFGR_NUM_PORT_Pos)          /*!< 0x0000000F */
#define OCTOSPIM_HWCFGR_NUM_PORT          OCTOSPIM_HWCFGR_NUM_PORT_Msk                    /*!< Number of ports */

