STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp257dxx_cm33.h
/*******************  Bits definition for RISC_PRIVCFGR5 register *************/
#define RISC_PRIVCFGR5_PRIV160_Pos    (0U)
#define RISC_PRIVCFGR5_PRIV160_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV160_Pos)      /*!< 0x00000001 */
#define RISC_PRIVCFGR5_PRIV160        RISC_PRIVCFGR5_PRIV160_Msk
#define RISC_PRIVCFGR5_PRIV161_Pos    (1U)
#define RISC_PRIVCFGR5_PRIV161_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV161_Pos)      /*!< 0x00000002 */
#define RISC_PRIVCFGR5_PRIV161        RISC_PRIVCFGR5_PRIV161_Msk
#define RISC_PRIVCFGR5_PRIV162_Pos    (2U)
#define RISC_PRIVCFGR5_PRIV162_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV162_Pos)      /*!< 0x00000004 */
#define RISC_PRIVCFGR5_PRIV162        RISC_PRIVCFGR5_PRIV162_Msk
#define RISC_PRIVCFGR5_PRIV163_Pos    (3U)
#define RISC_PRIVCFGR5_PRIV163_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV163_Pos)      /*!< 0x00000008 */
#define RISC_PRIVCFGR5_PRIV163        RISC_PRIVCFGR5_PRIV163_Msk
#define RISC_PRIVCFGR5_PRIV164_Pos    (4U)
#define RISC_PRIVCFGR5_PRIV164_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV164_Pos)      /*!< 0x00000010 */
#define RISC_PRIVCFGR5_PRIV164        RISC_PRIVCFGR5_PRIV164_Msk
#define RISC_PRIVCFGR5_PRIV165_Pos    (5U)
#define RISC_PRIVCFGR5_PRIV165_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV165_Pos)      /*!< 0x00000020 */
#define RISC_PRIVCFGR5_PRIV165        RISC_PRIVCFGR5_PRIV165_Msk
#define RISC_PRIVCFGR5_PRIV166_Pos    (6U)
#define RISC_PRIVCFGR5_PRIV166_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV166_Pos)      /*!< 0x00000040 */
#define RISC_PRIVCFGR5_PRIV166        RISC_PRIVCFGR5_PRIV166_Msk
#define RISC_PRIVCFGR5_PRIV167_Pos    (7U)
#define RISC_PRIVCFGR5_PRIV167_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV167_Pos)      /*!< 0x00000080 */
#define RISC_PRIVCFGR5_PRIV167        RISC_PRIVCFGR5_PRIV167_Msk
#define RISC_PRIVCFGR5_PRIV168_Pos    (8U)
#define RISC_PRIVCFGR5_PRIV168_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV168_Pos)      /*!< 0x00000100 */
#define RISC_PRIVCFGR5_PRIV168        RISC_PRIVCFGR5_PRIV168_Msk
#define RISC_PRIVCFGR5_PRIV169_Pos    (9U)
#define RISC_PRIVCFGR5_PRIV169_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV169_Pos)      /*!< 0x00000200 */
#define RISC_PRIVCFGR5_PRIV169        RISC_PRIVCFGR5_PRIV169_Msk
#define RISC_PRIVCFGR5_PRIV170_Pos    (10U)
#define RISC_PRIVCFGR5_PRIV170_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV170_Pos)      /*!< 0x00000400 */
#define RISC_PRIVCFGR5_PRIV170        RISC_PRIVCFGR5_PRIV170_Msk
#define RISC_PRIVCFGR5_PRIV171_Pos    (11U)
#define RISC_PRIVCFGR5_PRIV171_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV171_Pos)      /*!< 0x00000800 */
#define RISC_PRIVCFGR5_PRIV171        RISC_PRIVCFGR5_PRIV171_Msk
#define RISC_PRIVCFGR5_PRIV172_Pos    (12U)
#define RISC_PRIVCFGR5_PRIV172_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV172_Pos)      /*!< 0x00001000 */
#define RISC_PRIVCFGR5_PRIV172        RISC_PRIVCFGR5_PRIV172_Msk
#define RISC_PRIVCFGR5_PRIV173_Pos    (13U)
#define RISC_PRIVCFGR5_PRIV173_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV173_Pos)      /*!< 0x00002000 */
#define RISC_PRIVCFGR5_PRIV173        RISC_PRIVCFGR5_PRIV173_Msk
#define RISC_PRIVCFGR5_PRIV174_Pos    (14U)
#define RISC_PRIVCFGR5_PRIV174_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV174_Pos)      /*!< 0x00004000 */
#define RISC_PRIVCFGR5_PRIV174        RISC_PRIVCFGR5_PRIV174_Msk
#define RISC_PRIVCFGR5_PRIV175_Pos    (15U)
#define RISC_PRIVCFGR5_PRIV175_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV175_Pos)      /*!< 0x00008000 */
#define RISC_PRIVCFGR5_PRIV175        RISC_PRIVCFGR5_PRIV175_Msk
#define RISC_PRIVCFGR5_PRIV176_Pos    (16U)
#define RISC_PRIVCFGR5_PRIV176_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV176_Pos)      /*!< 0x00010000 */
#define RISC_PRIVCFGR5_PRIV176        RISC_PRIVCFGR5_PRIV176_Msk
#define RISC_PRIVCFGR5_PRIV177_Pos    (17U)
#define RISC_PRIVCFGR5_PRIV177_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV177_Pos)      /*!< 0x00020000 */
#define RISC_PRIVCFGR5_PRIV177        RISC_PRIVCFGR5_PRIV177_Msk
#define RISC_PRIVCFGR5_PRIV178_Pos    (18U)
#define RISC_PRIVCFGR5_PRIV178_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV178_Pos)      /*!< 0x00040000 */
#define RISC_PRIVCFGR5_PRIV178        RISC_PRIVCFGR5_PRIV178_Msk
#define RISC_PRIVCFGR5_PRIV179_Pos    (19U)
#define RISC_PRIVCFGR5_PRIV179_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV179_Pos)      /*!< 0x00080000 */
#define RISC_PRIVCFGR5_PRIV179        RISC_PRIVCFGR5_PRIV179_Msk
#define RISC_PRIVCFGR5_PRIV180_Pos    (20U)
#define RISC_PRIVCFGR5_PRIV180_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV180_Pos)      /*!< 0x00100000 */
#define RISC_PRIVCFGR5_PRIV180        RISC_PRIVCFGR5_PRIV180_Msk
#define RISC_PRIVCFGR5_PRIV181_Pos    (21U)
#define RISC_PRIVCFGR5_PRIV181_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV181_Pos)      /*!< 0x00200000 */
#define RISC_PRIVCFGR5_PRIV181        RISC_PRIVCFGR5_PRIV181_Msk
#define RISC_PRIVCFGR5_PRIV182_Pos    (22U)
#define RISC_PRIVCFGR5_PRIV182_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV182_Pos)      /*!< 0x00400000 */
#define RISC_PRIVCFGR5_PRIV182        RISC_PRIVCFGR5_PRIV182_Msk
#define RISC_PRIVCFGR5_PRIV183_Pos    (23U)
#define RISC_PRIVCFGR5_PRIV183_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV183_Pos)      /*!< 0x00800000 */
#define RISC_PRIVCFGR5_PRIV183        RISC_PRIVCFGR5_PRIV183_Msk
#define RISC_PRIVCFGR5_PRIV184_Pos    (24U)
#define RISC_PRIVCFGR5_PRIV184_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV184_Pos)      /*!< 0x01000000 */
#define RISC_PRIVCFGR5_PRIV184        RISC_PRIVCFGR5_PRIV184_Msk
#define RISC_PRIVCFGR5_PRIV185_Pos    (25U)
#define RISC_PRIVCFGR5_PRIV185_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV185_Pos)      /*!< 0x02000000 */
#define RISC_PRIVCFGR5_PRIV185        RISC_PRIVCFGR5_PRIV185_Msk
#define RISC_PRIVCFGR5_PRIV186_Pos    (26U)
#define RISC_PRIVCFGR5_PRIV186_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV186_Pos)      /*!< 0x04000000 */
#define RISC_PRIVCFGR5_PRIV186        RISC_PRIVCFGR5_PRIV186_Msk
#define RISC_PRIVCFGR5_PRIV187_Pos    (27U)
#define RISC_PRIVCFGR5_PRIV187_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV187_Pos)      /*!< 0x08000000 */
#define RISC_PRIVCFGR5_PRIV187        RISC_PRIVCFGR5_PRIV187_Msk
#define RISC_PRIVCFGR5_PRIV188_Pos    (28U)
#define RISC_PRIVCFGR5_PRIV188_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV188_Pos)      /*!< 0x10000000 */
#define RISC_PRIVCFGR5_PRIV188        RISC_PRIVCFGR5_PRIV188_Msk
#define RISC_PRIVCFGR5_PRIV189_Pos    (29U)
#define RISC_PRIVCFGR5_PRIV189_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV189_Pos)      /*!< 0x20000000 */
#define RISC_PRIVCFGR5_PRIV189        RISC_PRIVCFGR5_PRIV189_Msk
#define RISC_PRIVCFGR5_PRIV190_Pos    (30U)
#define RISC_PRIVCFGR5_PRIV190_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV190_Pos)      /*!< 0x40000000 */
#define RISC_PRIVCFGR5_PRIV190        RISC_PRIVCFGR5_PRIV190_Msk
#define RISC_PRIVCFGR5_PRIV191_Pos    (31U)
#define RISC_PRIVCFGR5_PRIV191_Msk    (0x1UL << RISC_PRIVCFGR5_PRIV191_Pos)      /*!< 0x80000000 */
#define RISC_PRIVCFGR5_PRIV191        RISC_PRIVCFGR5_PRIV191_Msk

/*******************  Bits definition for RISC_RCFGLOCKR0 register *************/
#define RISC_RCFGLOCKR0_RLOCK0_Pos     (0U)
#define RISC_RCFGLOCKR0_RLOCK0_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK0_Pos)       /*!< 0x00000001 */
#define RISC_RCFGLOCKR0_RLOCK0         RISC_RCFGLOCKR0_RLOCK0_Msk
#define RISC_RCFGLOCKR0_RLOCK1_Pos     (1U)
#define RISC_RCFGLOCKR0_RLOCK1_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK1_Pos)       /*!< 0x00000002 */
#define RISC_RCFGLOCKR0_RLOCK1         RISC_RCFGLOCKR0_RLOCK1_Msk
#define RISC_RCFGLOCKR0_RLOCK2_Pos     (2U)
#define RISC_RCFGLOCKR0_RLOCK2_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK2_Pos)       /*!< 0x00000004 */
#define RISC_RCFGLOCKR0_RLOCK2         RISC_RCFGLOCKR0_RLOCK2_Msk
#define RISC_RCFGLOCKR0_RLOCK3_Pos     (3U)
#define RISC_RCFGLOCKR0_RLOCK3_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK3_Pos)       /*!< 0x00000008 */
#define RISC_RCFGLOCKR0_RLOCK3         RISC_RCFGLOCKR0_RLOCK3_Msk
#define RISC_RCFGLOCKR0_RLOCK4_Pos     (4U)
#define RISC_RCFGLOCKR0_RLOCK4_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK4_Pos)       /*!< 0x00000010 */
#define RISC_RCFGLOCKR0_RLOCK4         RISC_RCFGLOCKR0_RLOCK4_Msk
#define RISC_RCFGLOCKR0_RLOCK5_Pos     (5U)
#define RISC_RCFGLOCKR0_RLOCK5_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK5_Pos)       /*!< 0x00000020 */
#define RISC_RCFGLOCKR0_RLOCK5         RISC_RCFGLOCKR0_RLOCK5_Msk
#define RISC_RCFGLOCKR0_RLOCK6_Pos     (6U)
#define RISC_RCFGLOCKR0_RLOCK6_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK6_Pos)       /*!< 0x00000040 */
#define RISC_RCFGLOCKR0_RLOCK6         RISC_RCFGLOCKR0_RLOCK6_Msk
#define RISC_RCFGLOCKR0_RLOCK7_Pos     (7U)
#define RISC_RCFGLOCKR0_RLOCK7_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK7_Pos)       /*!< 0x00000080 */
#define RISC_RCFGLOCKR0_RLOCK7         RISC_RCFGLOCKR0_RLOCK7_Msk
#define RISC_RCFGLOCKR0_RLOCK8_Pos     (8U)
#define RISC_RCFGLOCKR0_RLOCK8_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK8_Pos)       /*!< 0x00000100 */
#define RISC_RCFGLOCKR0_RLOCK8         RISC_RCFGLOCKR0_RLOCK8_Msk
#define RISC_RCFGLOCKR0_RLOCK9_Pos     (9U)
#define RISC_RCFGLOCKR0_RLOCK9_Msk     (0x1UL << RISC_RCFGLOCKR0_RLOCK9_Pos)       /*!< 0x00000200 */
#define RISC_RCFGLOCKR0_RLOCK9         RISC_RCFGLOCKR0_RLOCK9_Msk
#define RISC_RCFGLOCKR0_RLOCK10_Pos    (10U)
#define RISC_RCFGLOCKR0_RLOCK10_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK10_Pos)      /*!< 0x00000400 */
#define RISC_RCFGLOCKR0_RLOCK10        RISC_RCFGLOCKR0_RLOCK10_Msk
#define RISC_RCFGLOCKR0_RLOCK11_Pos    (11U)
#define RISC_RCFGLOCKR0_RLOCK11_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK11_Pos)      /*!< 0x00000800 */
#define RISC_RCFGLOCKR0_RLOCK11        RISC_RCFGLOCKR0_RLOCK11_Msk
#define RISC_RCFGLOCKR0_RLOCK12_Pos    (12U)
#define RISC_RCFGLOCKR0_RLOCK12_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK12_Pos)      /*!< 0x00001000 */
#define RISC_RCFGLOCKR0_RLOCK12        RISC_RCFGLOCKR0_RLOCK12_Msk
#define RISC_RCFGLOCKR0_RLOCK13_Pos    (13U)
#define RISC_RCFGLOCKR0_RLOCK13_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK13_Pos)      /*!< 0x00002000 */
#define RISC_RCFGLOCKR0_RLOCK13        RISC_RCFGLOCKR0_RLOCK13_Msk
#define RISC_RCFGLOCKR0_RLOCK14_Pos    (14U)
#define RISC_RCFGLOCKR0_RLOCK14_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK14_Pos)      /*!< 0x00004000 */
#define RISC_RCFGLOCKR0_RLOCK14        RISC_RCFGLOCKR0_RLOCK14_Msk
#define RISC_RCFGLOCKR0_RLOCK15_Pos    (15U)
#define RISC_RCFGLOCKR0_RLOCK15_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK15_Pos)      /*!< 0x00008000 */
#define RISC_RCFGLOCKR0_RLOCK15        RISC_RCFGLOCKR0_RLOCK15_Msk
#define RISC_RCFGLOCKR0_RLOCK16_Pos    (16U)
#define RISC_RCFGLOCKR0_RLOCK16_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK16_Pos)      /*!< 0x00010000 */
#define RISC_RCFGLOCKR0_RLOCK16        RISC_RCFGLOCKR0_RLOCK16_Msk
#define RISC_RCFGLOCKR0_RLOCK17_Pos    (17U)
#define RISC_RCFGLOCKR0_RLOCK17_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK17_Pos)      /*!< 0x00020000 */
#define RISC_RCFGLOCKR0_RLOCK17        RISC_RCFGLOCKR0_RLOCK17_Msk
#define RISC_RCFGLOCKR0_RLOCK18_Pos    (18U)
#define RISC_RCFGLOCKR0_RLOCK18_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK18_Pos)      /*!< 0x00040000 */
#define RISC_RCFGLOCKR0_RLOCK18        RISC_RCFGLOCKR0_RLOCK18_Msk
#define RISC_RCFGLOCKR0_RLOCK19_Pos    (19U)
#define RISC_RCFGLOCKR0_RLOCK19_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK19_Pos)      /*!< 0x00080000 */
#define RISC_RCFGLOCKR0_RLOCK19        RISC_RCFGLOCKR0_RLOCK19_Msk
#define RISC_RCFGLOCKR0_RLOCK20_Pos    (20U)
#define RISC_RCFGLOCKR0_RLOCK20_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK20_Pos)      /*!< 0x00100000 */
#define RISC_RCFGLOCKR0_RLOCK20        RISC_RCFGLOCKR0_RLOCK20_Msk
#define RISC_RCFGLOCKR0_RLOCK21_Pos    (21U)
#define RISC_RCFGLOCKR0_RLOCK21_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK21_Pos)      /*!< 0x00200000 */
#define RISC_RCFGLOCKR0_RLOCK21        RISC_RCFGLOCKR0_RLOCK21_Msk
#define RISC_RCFGLOCKR0_RLOCK22_Pos    (22U)
#define RISC_RCFGLOCKR0_RLOCK22_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK22_Pos)      /*!< 0x00400000 */
#define RISC_RCFGLOCKR0_RLOCK22        RISC_RCFGLOCKR0_RLOCK22_Msk
#define RISC_RCFGLOCKR0_RLOCK23_Pos    (23U)
#define RISC_RCFGLOCKR0_RLOCK23_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK23_Pos)      /*!< 0x00800000 */
#define RISC_RCFGLOCKR0_RLOCK23        RISC_RCFGLOCKR0_RLOCK23_Msk
#define RISC_RCFGLOCKR0_RLOCK24_Pos    (24U)
#define RISC_RCFGLOCKR0_RLOCK24_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK24_Pos)      /*!< 0x01000000 */
#define RISC_RCFGLOCKR0_RLOCK24        RISC_RCFGLOCKR0_RLOCK24_Msk
#define RISC_RCFGLOCKR0_RLOCK25_Pos    (25U)
#define RISC_RCFGLOCKR0_RLOCK25_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK25_Pos)      /*!< 0x02000000 */
#define RISC_RCFGLOCKR0_RLOCK25        RISC_RCFGLOCKR0_RLOCK25_Msk
#define RISC_RCFGLOCKR0_RLOCK26_Pos    (26U)
#define RISC_RCFGLOCKR0_RLOCK26_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK26_Pos)      /*!< 0x04000000 */
#define RISC_RCFGLOCKR0_RLOCK26        RISC_RCFGLOCKR0_RLOCK26_Msk
#define RISC_RCFGLOCKR0_RLOCK27_Pos    (27U)
#define RISC_RCFGLOCKR0_RLOCK27_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK27_Pos)      /*!< 0x08000000 */
#define RISC_RCFGLOCKR0_RLOCK27        RISC_RCFGLOCKR0_RLOCK27_Msk
#define RISC_RCFGLOCKR0_RLOCK28_Pos    (28U)
#define RISC_RCFGLOCKR0_RLOCK28_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK28_Pos)      /*!< 0x10000000 */
#define RISC_RCFGLOCKR0_RLOCK28        RISC_RCFGLOCKR0_RLOCK28_Msk
#define RISC_RCFGLOCKR0_RLOCK29_Pos    (29U)
#define RISC_RCFGLOCKR0_RLOCK29_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK29_Pos)      /*!< 0x20000000 */
#define RISC_RCFGLOCKR0_RLOCK29        RISC_RCFGLOCKR0_RLOCK29_Msk
#define RISC_RCFGLOCKR0_RLOCK30_Pos    (30U)
#define RISC_RCFGLOCKR0_RLOCK30_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK30_Pos)      /*!< 0x40000000 */
#define RISC_RCFGLOCKR0_RLOCK30        RISC_RCFGLOCKR0_RLOCK30_Msk
#define RISC_RCFGLOCKR0_RLOCK31_Pos    (31U)
#define RISC_RCFGLOCKR0_RLOCK31_Msk    (0x1UL << RISC_RCFGLOCKR0_RLOCK31_Pos)      /*!< 0x80000000 */
#define RISC_RCFGLOCKR0_RLOCK31        RISC_RCFGLOCKR0_RLOCK31_Msk

/*******************  Bits definition for RISC_RCFGLOCKR1 register *************/
#define RISC_RCFGLOCKR1_RLOCK32_Pos    (0U)
#define RISC_RCFGLOCKR1_RLOCK32_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK32_Pos)      /*!< 0x00000001 */
#define RISC_RCFGLOCKR1_RLOCK32        RISC_RCFGLOCKR1_RLOCK32_Msk
#define RISC_RCFGLOCKR1_RLOCK33_Pos    (1U)
#define RISC_RCFGLOCKR1_RLOCK33_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK33_Pos)      /*!< 0x00000002 */
#define RISC_RCFGLOCKR1_RLOCK33        RISC_RCFGLOCKR1_RLOCK33_Msk
#define RISC_RCFGLOCKR1_RLOCK34_Pos    (2U)
#define RISC_RCFGLOCKR1_RLOCK34_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK34_Pos)      /*!< 0x00000004 */
#define RISC_RCFGLOCKR1_RLOCK34        RISC_RCFGLOCKR1_RLOCK34_Msk
#define RISC_RCFGLOCKR1_RLOCK35_Pos    (3U)
#define RISC_RCFGLOCKR1_RLOCK35_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK35_Pos)      /*!< 0x00000008 */
#define RISC_RCFGLOCKR1_RLOCK35        RISC_RCFGLOCKR1_RLOCK35_Msk
#define RISC_RCFGLOCKR1_RLOCK36_Pos    (4U)
#define RISC_RCFGLOCKR1_RLOCK36_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK36_Pos)      /*!< 0x00000010 */
#define RISC_RCFGLOCKR1_RLOCK36        RISC_RCFGLOCKR1_RLOCK36_Msk
#define RISC_RCFGLOCKR1_RLOCK37_Pos    (5U)
#define RISC_RCFGLOCKR1_RLOCK37_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK37_Pos)      /*!< 0x00000020 */
#define RISC_RCFGLOCKR1_RLOCK37        RISC_RCFGLOCKR1_RLOCK37_Msk
#define RISC_RCFGLOCKR1_RLOCK38_Pos    (6U)
#define RISC_RCFGLOCKR1_RLOCK38_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK38_Pos)      /*!< 0x00000040 */
#define RISC_RCFGLOCKR1_RLOCK38        RISC_RCFGLOCKR1_RLOCK38_Msk
#define RISC_RCFGLOCKR1_RLOCK39_Pos    (7U)
#define RISC_RCFGLOCKR1_RLOCK39_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK39_Pos)      /*!< 0x00000080 */
#define RISC_RCFGLOCKR1_RLOCK39        RISC_RCFGLOCKR1_RLOCK39_Msk
#define RISC_RCFGLOCKR1_RLOCK40_Pos    (8U)
#define RISC_RCFGLOCKR1_RLOCK40_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK40_Pos)      /*!< 0x00000100 */
#define RISC_RCFGLOCKR1_RLOCK40        RISC_RCFGLOCKR1_RLOCK40_Msk
#define RISC_RCFGLOCKR1_RLOCK41_Pos    (9U)
#define RISC_RCFGLOCKR1_RLOCK41_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK41_Pos)      /*!< 0x00000200 */
#define RISC_RCFGLOCKR1_RLOCK41        RISC_RCFGLOCKR1_RLOCK41_Msk
#define RISC_RCFGLOCKR1_RLOCK42_Pos    (10U)
#define RISC_RCFGLOCKR1_RLOCK42_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK42_Pos)      /*!< 0x00000400 */
#define RISC_RCFGLOCKR1_RLOCK42        RISC_RCFGLOCKR1_RLOCK42_Msk
#define RISC_RCFGLOCKR1_RLOCK43_Pos    (11U)
#define RISC_RCFGLOCKR1_RLOCK43_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK43_Pos)      /*!< 0x00000800 */
#define RISC_RCFGLOCKR1_RLOCK43        RISC_RCFGLOCKR1_RLOCK43_Msk
#define RISC_RCFGLOCKR1_RLOCK44_Pos    (12U)
#define RISC_RCFGLOCKR1_RLOCK44_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK44_Pos)      /*!< 0x00001000 */
#define RISC_RCFGLOCKR1_RLOCK44        RISC_RCFGLOCKR1_RLOCK44_Msk
#define RISC_RCFGLOCKR1_RLOCK45_Pos    (13U)
#define RISC_RCFGLOCKR1_RLOCK45_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK45_Pos)      /*!< 0x00002000 */
#define RISC_RCFGLOCKR1_RLOCK45        RISC_RCFGLOCKR1_RLOCK45_Msk
#define RISC_RCFGLOCKR1_RLOCK46_Pos    (14U)
#define RISC_RCFGLOCKR1_RLOCK46_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK46_Pos)      /*!< 0x00004000 */
#define RISC_RCFGLOCKR1_RLOCK46        RISC_RCFGLOCKR1_RLOCK46_Msk
#define RISC_RCFGLOCKR1_RLOCK47_Pos    (15U)
#define RISC_RCFGLOCKR1_RLOCK47_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK47_Pos)      /*!< 0x00008000 */
#define RISC_RCFGLOCKR1_RLOCK47        RISC_RCFGLOCKR1_RLOCK47_Msk
#define RISC_RCFGLOCKR1_RLOCK48_Pos    (16U)
#define RISC_RCFGLOCKR1_RLOCK48_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK48_Pos)      /*!< 0x00010000 */
#define RISC_RCFGLOCKR1_RLOCK48        RISC_RCFGLOCKR1_RLOCK48_Msk
#define RISC_RCFGLOCKR1_RLOCK49_Pos    (17U)
#define RISC_RCFGLOCKR1_RLOCK49_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK49_Pos)      /*!< 0x00020000 */
#define RISC_RCFGLOCKR1_RLOCK49        RISC_RCFGLOCKR1_RLOCK49_Msk
#define RISC_RCFGLOCKR1_RLOCK50_Pos    (18U)
#define RISC_RCFGLOCKR1_RLOCK50_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK50_Pos)      /*!< 0x00040000 */
#define RISC_RCFGLOCKR1_RLOCK50        RISC_RCFGLOCKR1_RLOCK50_Msk
#define RISC_RCFGLOCKR1_RLOCK51_Pos    (19U)
#define RISC_RCFGLOCKR1_RLOCK51_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK51_Pos)      /*!< 0x00080000 */
#define RISC_RCFGLOCKR1_RLOCK51        RISC_RCFGLOCKR1_RLOCK51_Msk
#define RISC_RCFGLOCKR1_RLOCK52_Pos    (20U)
#define RISC_RCFGLOCKR1_RLOCK52_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK52_Pos)      /*!< 0x00100000 */
#define RISC_RCFGLOCKR1_RLOCK52        RISC_RCFGLOCKR1_RLOCK52_Msk
#define RISC_RCFGLOCKR1_RLOCK53_Pos    (21U)
#define RISC_RCFGLOCKR1_RLOCK53_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK53_Pos)      /*!< 0x00200000 */
#define RISC_RCFGLOCKR1_RLOCK53        RISC_RCFGLOCKR1_RLOCK53_Msk
#define RISC_RCFGLOCKR1_RLOCK54_Pos    (22U)
#define RISC_RCFGLOCKR1_RLOCK54_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK54_Pos)      /*!< 0x00400000 */
#define RISC_RCFGLOCKR1_RLOCK54        RISC_RCFGLOCKR1_RLOCK54_Msk
#define RISC_RCFGLOCKR1_RLOCK55_Pos    (23U)
#define RISC_RCFGLOCKR1_RLOCK55_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK55_Pos)      /*!< 0x00800000 */
#define RISC_RCFGLOCKR1_RLOCK55        RISC_RCFGLOCKR1_RLOCK55_Msk
#define RISC_RCFGLOCKR1_RLOCK56_Pos    (24U)
#define RISC_RCFGLOCKR1_RLOCK56_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK56_Pos)      /*!< 0x01000000 */
#define RISC_RCFGLOCKR1_RLOCK56        RISC_RCFGLOCKR1_RLOCK56_Msk
#define RISC_RCFGLOCKR1_RLOCK57_Pos    (25U)
#define RISC_RCFGLOCKR1_RLOCK57_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK57_Pos)      /*!< 0x02000000 */
#define RISC_RCFGLOCKR1_RLOCK57        RISC_RCFGLOCKR1_RLOCK57_Msk
#define RISC_RCFGLOCKR1_RLOCK58_Pos    (26U)
#define RISC_RCFGLOCKR1_RLOCK58_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK58_Pos)      /*!< 0x04000000 */
#define RISC_RCFGLOCKR1_RLOCK58        RISC_RCFGLOCKR1_RLOCK58_Msk
#define RISC_RCFGLOCKR1_RLOCK59_Pos    (27U)
#define RISC_RCFGLOCKR1_RLOCK59_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK59_Pos)      /*!< 0x08000000 */
#define RISC_RCFGLOCKR1_RLOCK59        RISC_RCFGLOCKR1_RLOCK59_Msk
#define RISC_RCFGLOCKR1_RLOCK60_Pos    (28U)
#define RISC_RCFGLOCKR1_RLOCK60_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK60_Pos)      /*!< 0x10000000 */
#define RISC_RCFGLOCKR1_RLOCK60        RISC_RCFGLOCKR1_RLOCK60_Msk
#define RISC_RCFGLOCKR1_RLOCK61_Pos    (29U)
#define RISC_RCFGLOCKR1_RLOCK61_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK61_Pos)      /*!< 0x20000000 */
#define RISC_RCFGLOCKR1_RLOCK61        RISC_RCFGLOCKR1_RLOCK61_Msk
#define RISC_RCFGLOCKR1_RLOCK62_Pos    (30U)
#define RISC_RCFGLOCKR1_RLOCK62_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK62_Pos)      /*!< 0x40000000 */
#define RISC_RCFGLOCKR1_RLOCK62        RISC_RCFGLOCKR1_RLOCK62_Msk
#define RISC_RCFGLOCKR1_RLOCK63_Pos    (31U)
#define RISC_RCFGLOCKR1_RLOCK63_Msk    (0x1UL << RISC_RCFGLOCKR1_RLOCK63_Pos)      /*!< 0x80000000 */
#define RISC_RCFGLOCKR1_RLOCK63        RISC_RCFGLOCKR1_RLOCK63_Msk

